[
{"company_name": "Little Words Project", "linkedin_followers_count": 7516, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQGxUA5OMzhFOA/company-logo_200_200/company-logo_200_200/0/1657036524342/little_words_project_logo?e=2147483647&v=beta&t=IExyAwxW3xgl6S3JfqSRQ0tSqCSbJSpz2Pq54lJNBWo", "about_us": "Little Words Project® encourages women to both be kind to themselves and to others.\n\nOur handcrafted bracelets are each made with a different inspirational word. Each bracelet features a tag inscribed with a registration code. This code is used to register your bracelet which enters you into the Nice Girl Gang - a community of women dedicated to building each other up. Wear your Little Word® for as long you need it to remind you of just how freakin’ great you are. Eventually, you’ll find someone who needs that reminder a little more - and you’ll pass it on, so they too can benefit from its message. Not only will it bring her the same good vibes it brought you, but it will also give her access to the Nice Girl community when she registers the same tag number on the Little Words Project® app or website.\n\nTogether we can do something positive to Girl World. But remember- it starts with you.", "num_of_employees": "not-found", "website": "http://www.littlewordsproject.com", "industry": "Retail Luxury Goods and Jewelry", "company_size_approx": "11-50", "headquarters": "Moutainside, New Jersey", "type": "Self-Owned", "founded": "2013"},
{"company_name": "Fortress Power", "linkedin_followers_count": 10078, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQHkIogKg9oCag/company-logo_200_200/company-logo_200_200/0/1630581758693/fortresspower_logo?e=2147483647&v=beta&t=GptQu22RRW17n9-kOZhxklXXzvZMJEIE1ZHpfaPkX2w", "about_us": "Fortress Power has proudly serviced homeowners and commercial clients worldwide. Our Pennsylvania-based team’s passion for clean energy storage using Lithium Iron Phosphate batteries has earned us a place among the world’s top energy storage battery manufacturers. We pride ourselves on bringing of businesses and households energy storage products they can depend on, built from only the highest quality, highest powered lithium ferrite phosphate batteries.\n\nWe strive to manufacture compact and reliable battery systems at affordable prices. You’ll never be left in the dark when you secure your energy with Fortress Power.", "num_of_employees": "not-found", "website": "http://www.FortressPower.com", "industry": "Renewable Energy Semiconductor Manufacturing", "company_size_approx": "51-200", "headquarters": "Langhorne, Pennsylvania", "type": "Privately Held", "founded": "2016", "specialties": "Green Energy, Lithium Batteries, Energy Storage, and Solar Storage", "funding": "not-found", "funding_total_rounds": 1, "funding_option": "Private equity", "last_funding_round": "Feb 10, 2022"},
{"company_name": "Utah Clean Energy", "linkedin_followers_count": 1738, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQEU7aJ2ZeoLlw/company-logo_200_200/company-logo_200_200/0/1630663588699/utah_clean_energy_logo?e=2147483647&v=beta&t=ZFJUosKUde-xB7IagKW_4SE_TfeY68QSPAJ8k3kTEA0", "about_us": "Utah Clean Energy is Utah’s leading, expert, public interest organization working to turn the tide on climate change by expanding renewable energy, energy efficiency, storage, and clean vehicles in a way that is beneficial not only for Utah’s environment and health, but our economy and long-term energy security. Utah Clean Energy is committed to creating a future that ensures healthy, thriving communities for all, empowered and sustained by clean energies such as solar, wind and energy efficiency. For more information visit www.utahcleanenergy.org.", "num_of_employees": "not-found", "website": "http://www.utahcleanenergy.org", "industry": "Non-profit Organizations", "company_size_approx": "11-50", "headquarters": "Salt Lake City, Utah", "type": "Nonprofit", "founded": "2002", "specialties": "climate solutions, energy efficiency, and climate policy", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Nevada Clean Energy Fund", "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQHeswiVcavqWg/company-logo_200_200/company-logo_200_200/0/1647468609653/nevada_clean_energy_fund_logo?e=2147483647&v=beta&t=Iye9E87JZTguEkEY-S1npw8b22_Ml6pIii5pD3apCks", "about_us": "The Nevada Clean Energy Fund (NCEF) is a non-profit organization created in 2017 by state legislation. NCEF’s mandate is to increase financing for clean energy projects in Nevada in a way that improves quality of life for Nevadans, reduces energy costs, creates jobs, and meaningfully addresses climate change. Clean energy projects can include renewable energy, energy efficiency, transportation electrification, and vehicle alternative fuels.\n\nNCEF was incubated over the course of four years with the support of the Coalition for Green Capital (CGC) and the NCEF Board of Directors, consisting of state government officials and nominees representing labor and local community interests from across the state. NCEF formally launched in early 2022.", "num_of_employees": "not-found", "website": "https://nevadacef.org/", "industry": "Banking", "company_size_approx": "1", "headquarters": "not-found", "type": "2018", "specialties": "clean energy bank", "funding": "US$ 156.0M", "funding_total_rounds": 1, "funding_option": "Grant", "last_funding_round": "May 22, 2024"},
{"company_name": "SitelogIQ", "linkedin_followers_count": 6259, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQGbhCdHIV463w/company-logo_200_200/company-logo_200_200/0/1630473063022/sitelogiq_logo?e=2147483647&v=beta&t=1itQE7wlkmzOtgxl0NS5svtfTu-QX0YwgdVqBqG-hIk", "about_us": "SitelogIQ is an energy efficiency and facility solutions company. We make buildings better for people where they live, learn, heal, work, and shop.", "num_of_employees": "not-found", "website": "http://sitelogiq.com", "industry": "Facilities Services", "company_size_approx": "501-1,000", "headquarters": "Minneapolis, Minnesota", "type": "Privately Held", "specialties": "Design, Engineering, Lighting, Energy, and Construction", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "NYSUT", "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQF9apd7ZXBFSg/company-logo_200_200/company-logo_200_200/0/1631332048892?e=2147483647&v=beta&t=GWtj3Ec-yqN_P7rGjmAIJDTlxI_Uo6uxafHT2sA8tvs", "about_us": "NYSUT is more than 600,000 people who work in, or are retired from, New York's schools, colleges, and healthcare facilities. We are classroom teachers, college and university faculty and professional staff, school bus drivers, custodians, secretaries, cafeteria workers, teacher assistants and aides, nurses and healthcare technicians.\r\n\r\nNYSUT is a federation of more than 1,200 local unions, each representing its own members. We are affiliated with the American Federation of Teachers (AFT) and the National Education Association (NEA). We are also part of organized labor - the AFL-CIO - and of Education International, with more than 20 million members world wide.\r\n\r\nWe range in size from tiny locals of fewer than 10 members to the United Federation of Teachers, which represents more than 140,000 teachers and other school employees in New York City.\r\n\r\nWe are dedicated to improving not only our working conditions, but also our professions. We're united in a common commitment to improve the quality of education and healthcare for the people of New York.", "num_of_employees": "not-found", "website": "http://www.nysut.org", "industry": "Non-profit Organizations", "company_size_approx": "201-500", "headquarters": "not-found", "type": "1972"},
{"company_name": "WER Architects/Planners", "linkedin_followers_count": 513, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQFePZxicJ-fLw/company-logo_200_200/company-logo_200_200/0/1635796986579/wer_architects_planners_logo?e=2147483647&v=beta&t=w8-s5y_4ddjlVzYClhtxB2g5BJHog82MmmDzXg8CYAg", "about_us": "The Power of Design\n\nWe believe that quality architecture creates better places. Better places to learn, better places to live, better places to heal, better places to work. We believe that the world is a better place with beauty, and that architecture enriches lives. As architects and interior designers, we believe all projects should be beautiful, purposeful, efficient, durable, belong to their surroundings and elevate the human spirit. It is what we live for. Every day.\n\nSince its founding in 1978, WER Architects/Planners has been noted for its tradition of architectural excellence and for its commitment to academic and scientific institutions, corporate and cultural institutions, as well as its celebrated achievements in historic preservation. As one of the state’s larger firms, WER’s size and organization allows it to continue a commitment to creating projects that consider the needs of the individual, combining form and function, to create powerful architecture.\n\nWER has been recognized for refined structures that reinforce the firm’s architectural ideal – timeless, honest architecture well-suited to its context. Projects reflect the principals’ beliefs that sound architecture is a collaborative effort that involves extensive research, rigorous study and thoughtful crafting that ultimately creates environments that are technically and culturally significant while also being sensitive to their surroundings.", "num_of_employees": "not-found", "website": "http://werarch.com", "industry": "Architecture and Planning", "company_size_approx": "11-50", "headquarters": "Little Rock, AR", "type": "Public Company", "founded": "1978", "specialties": "Architecture, Master Planning, Programming, and Interior Design", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Jupiter Power", "linkedin_followers_count": 32601, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQGnc86_I1UBxg/company-logo_200_200/company-logo_200_200/0/1657134927112/jupiterpower_logo?e=2147483647&v=beta&t=8W1MOjS8qr8gY03X5DreB6nr5rHHMPAyM-07o1Yoe2A", "about_us": "Jupiter Power is putting deep energy storage expertise, proven project execution capability, and significant capital to work to help make the energy transition a reality. \n\nJupiter is backed by BlackRock’s Diversified Infrastructure business. Together, we are capitalized to build, own, operate and trade products from our portfolio of energy storage assets.\n\nJupiter’s fleet of assets in operation or construction includes the largest energy storage fleet in Texas and one of the largest development pipelines in the country – totaling over 11,000 megawatts.", "num_of_employees": "not-found", "website": "http://www.jupiterpower.io", "industry": "Electric Power Generation", "company_size_approx": "51-200", "headquarters": "Austin, Texas", "type": "Partnership", "founded": "2017"},
{"company_name": "ISLAMIC INSTITUTE OF ORANGE COUNTY", "linkedin_followers_count": 14, "company_logo_url": "https://static-exp2.licdn.com/aero-v1/sc/h/cs8pjfgyw96g44ln9r7tct85f", "about_us": "External link for ISLAMIC INSTITUTE OF ORANGE COUNTY", "num_of_employees": "not-found", "website": "http://iioc.com", "industry": "Public Relations and Communications Services", "company_size_approx": "11-50", "headquarters": "ANAHEIM, California"},
{"company_name": "TAGGART / Architects", "linkedin_followers_count": 666, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQGc6mWjMuJP0g/company-logo_200_200/company-logo_200_200/0/1630613382561/taggart_architects_logo?e=2147483647&v=beta&t=uJ1GRle4LdO3-EWv-Nr8qbKtip2zwjrOZib_RCruwno", "about_us": "One of the state’s largest firms, TAGGART / Architects boasts a solid reputation for achieving design excellence, budget cost control and careful project management.\n\nTaggart is not only a leader in design, winning many AIA design awards but also in sustainable design, achieving LEED and Green Globe certifications for several clients.\n\nIn a world where personal service has almost disappeared, we have thrived for 47 years by continuing to provide the kind of exceptional service that leads to repeat business. . \n\nA good architectural firm with experienced and talented personnel can design with great success in any building category, and our accomplishments prove it. We have received major commissions for projects in Arkansas including such projects as Simmons Bank Arena, Dickey-Stephens Ball Park, Bell Engineering Center at the University of Arkansas at Fayetteville, the College of Business University of Central Arkansas and the State Police Headquarters and Crime Laboratory Complex in Little Rock.\n\nWe believe that excellent architecture is possible on any project. Vision, experience, and a keen sense of responsibility for the client and project are the qualities an architect must have to consistently achieve excellence.", "num_of_employees": "not-found", "website": "http://taggarch.com", "industry": "Architecture and Planning", "company_size_approx": "11-50", "headquarters": "North Little Rock, AR", "type": "Privately Held", "founded": "1974", "specialties": "Healthcare, Educational, Commercial, Corporate, Industrial, Multifamily Residential, Historic Preservation, Adaptive Reuse, and Sports & Recreation", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Jenkins•Peer Architects", "linkedin_followers_count": 2009, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQHZyxIApeUtmw/company-logo_200_200/company-logo_200_200/0/1630626828224/jenkins_peer_architects_logo?e=2147483647&v=beta&t=dMzRTiPmRWCtqSdTTYGz5TeFyQI3-QCrA79pYDw2Npk", "about_us": "Since 1978, Jenkins•Peer Architects (J•PA) has delivered thoughtful design that enriches our communities, respects our environment, and delivers lasting value for our clients. The Charlotte-based firm offers planning, architectural, and interior design services throughout the Southeast. \r\n\r\nJ•PA’s portfolio reveals a strong focus on projects for colleges and universities including buildings that support 21st Century teaching, science and research, fine and performing arts, sports and recreation, administration, and student life.  Other work—including corporate offices, mixed-use complexes, industrial / warehouse facilities, residential, libraries, civic, religious, and cultural facilities—round out the firm’s diverse project mix.\r\n\r\nWhile J•PA’s design portfolio is wide-ranging, our approach remains constant:  listen, respond, and deliver.  We focus on building community—a commitment that is evident in our collaborative approach, our dedication to sustainable design principles, and our active engagement with the individuals and organizations that support and define our communities.  J•PA’s long-standing relationships and the noteworthy projects that result reflect the dedication and caring spirit of our entire staff.", "num_of_employees": "not-found", "website": "http://www.jenkinspeer.com/", "industry": "Architecture and Planning", "company_size_approx": "11-50", "headquarters": "Charlotte, North Carolina", "type": "Privately Held", "founded": "1978", "specialties": "Architecture, Design, Planning, Construction Contract Administration, Historic Preservation, Environmental Graphics, Renovation, Programming, Sustainable Design, and Interior Design", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Solariant Capital LLC", "linkedin_followers_count": 2365, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQFKTOlnrABR8w/company-logo_200_200/company-logo_200_200/0/1665250779618/solariant_capital_llc_logo?e=2147483647&v=beta&t=ph7vln0y-XNvOtfsgMzAqVZoYZ_XLealWauOdSuKCxo", "about_us": "Solariant Capital is a renewable energy development and investment company headquartered in Pasadena, California with three other international offices in Tokyo, Seoul, and Manila.\n\nEstablished in 2012, Solariant Capital has been actively developing and investing in renewable energy power plant projects and related energy fuel. It has also been developing crowdfunding platform projects and financing platform projects since its inception in 2012. In January of 2019, Solariant Capital also launched the Solariant Renewable Energy Fund I (“SREF I”) to invest in development-stage renewable energy projects. SREF I invests in projects developed by Solariant Capital and its subsidiaries.\n\nProven track record of successful project development, financing, and completion.\n\nSpecializing in:\n-Project Development: \n-Equity, Senior, and Mezzanine Financing\n-Project Acquisition\n-Power Sales\n-Project Assessment and Valuation\n-Sourcing Alternative Investments\n-Development and Strategic Joint Ventures\n-Traditional and Virtual Power Purchase Agreements", "num_of_employees": "not-found", "website": "https://solariant.com/", "industry": "Financial Services", "company_size_approx": "51-200", "headquarters": "Pasadena, California", "type": "Privately Held", "founded": "2012"},
{"company_name": "Wagner Murray", "linkedin_followers_count": 221, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQF4VHXpA6pE5A/company-logo_200_200/company-logo_200_200/0/1631365271142/wagner_murray_architects_pa_logo?e=2147483647&v=beta&t=-JpXtXyeP720Hft_jRu38RxOUfn5366SNHIW4ZkyJo0", "about_us": "Wagner Murray is a boutique architecture and interior design firm in Charlotte, NC. We believe in connecting people to places through great design.", "num_of_employees": "not-found", "website": "http://www.wagnermurray.com", "industry": "Architecture and Planning", "company_size_approx": "2-10", "headquarters": "Charlotte, North Carolina", "type": "Privately Held", "founded": "1990", "specialties": "Architecture + Planning, Stadium Interiors + Renvoations, Restaurant Design, Public Spaces, Corporate + Commercial Design, Civic Design, and Retail Design", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "City of University Place", "linkedin_followers_count": 277, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQE23-T1RakOdw/company-logo_200_200/company-logo_200_200/0/1630661868077/city_of_university_place_logo?e=2147483647&v=beta&t=eVf7bWaBFheoJHs0a9vl2EGkVfgyt_VNiMY5amWGARY", "about_us": "Located on the picturesque Puget Sound, the City of University Place is home to more than 31,500 active residents. Halfway between the state capital of Olympia and the state’s largest city, Seattle, the City boasts beautiful scenic views of the Olympic Mountains, Mount Rainier and the Puget Sound, and is the ideal launching point to the Pacific Northwest.", "num_of_employees": "not-found", "website": "http://www.cityofup.com", "industry": "Government Administration", "company_size_approx": "11-50", "headquarters": "University Place, Washington", "type": "Government Agency", "founded": "1995"},
{"company_name": "Glide", "linkedin_followers_count": 16688, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQGnKV35SelKVg/company-logo_200_200/company-logo_200_200/0/1631829701842/glideapps_logo?e=2147483647&v=beta&t=memi1ZGPdhjN4M7NT2DVpWW-_-94oBHsaqO0f1D5iIE", "about_us": "Glide is a no code software development platform for building custom apps that optimize your business.", "num_of_employees": "not-found", "website": "https://glideapps.com", "industry": "Software Development", "company_size_approx": "51-200", "headquarters": "San Francisco, California", "type": "Privately Held", "founded": "2018"},
{"company_name": "Michigan Saves", "linkedin_followers_count": 964, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQFYImq6FNTEsg/company-logo_200_200/company-logo_200_200/0/1630646741084/michigan_saves_logo?e=2147483647&v=beta&t=dgiRrp-bQzWJhqQhe4ipBJSqBN4GMOJVPJdzYg-82Pg", "about_us": "We are Michigan Saves, the nation’s first nonprofit green bank. Our organization is all in on clean energy—efficiency, renewables, diversification, carbon reduction—you name it. We know how powerful these energy sources are and want everyone—no exceptions—to have access to their benefits. But for many, these improvements are too costly. That’s where we come in.", "num_of_employees": "not-found", "website": "http://MichiganSaves.org", "industry": "Financial Services", "company_size_approx": "11-50", "headquarters": "Lansing, Michigan", "type": "Nonprofit", "founded": "2009"},
{"company_name": "SYSO Technologies", "linkedin_followers_count": 1082, "company_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQGQmu9AZPp0zQ/company-logo_200_200/company-logo_200_200/0/1688761273047/syso_technologies_logo?e=2147483647&v=beta&t=Z6vJbMOaEEo7GtqDIMAuc17Nw5qlLbUtiPeqyqcZ2fQ", "about_us": "SYSO Technologies envisions a power grid free from the use of fossil fuels. In order to achieve this vision, SYSO is actively working with asset owners to transform passive renewable generators into active renewable generation via SYSO's cloud-based Energy Management Platform.", "num_of_employees": "not-found", "website": "http://www.sysotechnologies.com", "industry": "Renewable Energy Power Generation", "company_size_approx": "11-50", "headquarters": "Cambridge, MASSACHUSETTS", "type": "Privately Held", "founded": "2019"},
{"company_name": "Birchfield Penuel Architects", "linkedin_followers_count": 431, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQEjIfSfEc30lg/company-logo_200_200/company-logo_200_200/0/1698100206004/birchfield_penuel__associates_llc_logo?e=2147483647&v=beta&t=dQukwqQ3A09zO8hjTHdU_YuRttwa0qgIfUbg0ZVdvWw", "about_us": "Birchfield Penuel Architects is a full-service Architecture & Design firm with an award-winning team of architects & interior designers based in Alabama. For almost 40 years, we've watched the architecture industry change and our clients grow. We're honored to have been there every step of the way, learning and growing with them. The times are changing, and we're better for it. Innovation keeps us sharp, and experience makes us effective. In an age when every idea is tested, our core values continue to prove invaluable to our clients and ourselves.", "num_of_employees": "not-found", "website": "http://www.bpa.net", "industry": "Architecture and Planning", "company_size_approx": "11-50", "headquarters": "Birmingham, Alabama", "type": "Privately Held", "founded": "1987"},
{"company_name": "Capital Power", "linkedin_followers_count": 24846, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQELmqWiA6jnbQ/company-logo_200_200/company-logo_200_200/0/1630589981558/capital_power_logo?e=2147483647&v=beta&t=6vU4sryBfnJFsUBgVsZcZj8TiAQUexEILRf5uVdVTkA", "about_us": "Capital Power (TSX: CPX) is a growth-oriented power producer with approximately 9,300 MW of power generation at 32 facilities across North America. We prioritize safely delivering reliable and affordable power communities can depend on today, building clean power systems needed for tomorrow, and creating balanced solutions for our energy future.", "num_of_employees": "not-found", "website": "http://www.capitalpower.com", "industry": "Utilities", "company_size_approx": "501-1,000", "headquarters": "Edmonton, Alberta", "type": "Public Company", "founded": "2009"},
{"company_name": "Meridian Clean Energy", "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQHORnhymYzURQ/company-logo_200_200/company-logo_200_200/0/1630656167262?e=2147483647&v=beta&t=JvV1nDC2a7IYpwYoeYUfiqGA6b6TTxFXyS0xY6ob9j8", "about_us": "Meridian is investing in and developing assets that will support a 24/7 decarbonized power grid for the future", "num_of_employees": "not-found", "website": "http://www.meridiancleanenergy.com", "industry": "Renewables & Environment", "company_size_approx": "2-10", "headquarters": "not-found"},
{"company_name": "Turner Construction Company", "linkedin_followers_count": 664456, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQFdzRrX3YAi9w/company-logo_200_200/company-logo_200_200/0/1631309252711?e=2147483647&v=beta&t=z4xXFdGjmgioKWShsVwzYn-HzCudZpJ5I2PP0HsH_wI", "about_us": "Turner is a North America-based, international construction services company and is a leading builder in diverse and numerous market segments. The company has earned recognition for undertaking large, complex projects, fostering innovation, embracing emerging technologies, and making a difference for their clients, employees and community.  \n\nOUR VISION \nTo be the highest value provider of global construction services and technical expertise. \n \nTurner embraces a Lean management approach, and a culture that emphasizes collaboration, reliability of scheduling and delivery of the most value while consuming the fewest resources. Lean principles drive the efficient delivery of our services. \n\nTurner recognizes the importance of innovation and fostering a culture of continuous improvement. A key element of our company vision is to develop and embrace emerging technologies and processes. As part of our effort to achieve this vision, Turner has a culture where employees share their ideas and engagement with one another to develop innovative ideas as well as evaluate and implement improvements at Turner.\n\nTurner fosters a culture of diversity and inclusion in which all employees contribute creative ideas, seek challenges, and have the opportunity to grow. Our diverse and inclusive workforce positions the company to grow, enhances our presence in diverse markets, and helps us build enduring relationships with each other, industry partners, and our clients.\n\nTurner understands the environmental, social, and economic impact of our activities and that it is our responsibility to conduct our business in a transparent and ethical manner that supports our goals for client service, community involvement, environmental performance, financial strength and employee health, safety and well-being.  Our core values of integrity, teamwork and commitment guide our activities and we expect the organizations with which we do business to share our commitments.", "num_of_employees": "not-found", "website": "http://www.turnerconstruction.com", "industry": "Construction", "company_size_approx": "10,001+", "headquarters": "New York, NY", "type": "Privately Held", "founded": "1902", "specialties": "Lean Construction, Construction Management, Green Building, Building Information Modeling, Medical Planning & Procurement, Facility Management Solutions, Design/Build, Construction Management, General Contracting, Engineering, Resiliency, and Mass Timber", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Town of Needham, MA", "linkedin_followers_count": 499, "company_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQG1UwzbhWknZQ/company-logo_200_200/company-logo_200_200/0/1732388583484/needham_logo?e=2147483647&v=beta&t=7r1fXWZ2AruN8nBP2kAFyERrD9fo6kdNkltL9cDn-iA", "about_us": "The Town of Needham is located on rocky uplands within a loop of the Charles River in Eastern Massachusetts. The town is bordered by Wellesley on the west and northwest, Newton on the north and northeast, the West Roxbury section of Boston on the east, Dedham on the southeast and south, and Westwood and Dover on the south. Needham is ten miles southwest of Boston, twenty-nine miles east of Worcester, and about 208 miles from New York City. Needham is situated in the greater Boston area, which has excellent rail, air, and highway facilities. Principal highways are State Routes 128 (the inner belt around Boston) and 135, and Interstate Route 95, which shares the same roadway as State Route 128. Commuter rail service is available via four stations to Back Bay Station and South Station in Boston. Needham is a member of the Massachusetts Bay Transportation Authority (MBTA), which provides fixed bus route service between Needham Junction and Watertown Square\n\nAs a Town of Needham employee, you are offered a rewarding career-opportunity serving the Needham community, a thriving and growing town of approximately 32,000 residents and a diverse commercial tax base. The municipality has a Representative Town Meeting form of government, with a 5-member elected Select Board who appoints a Town Manger to serve as the Chief Executive Officer. Town departments include public works, police, fire, library, public health, and more!\n\nThe Town of Needham is a professionally run organization that is committed to creating an inclusive culture where employees can perform at the highest levels. Our employees are dedicated to their work and understand that the diverse perspectives of Town employees are critical to ensuring Needham remains an equitable community, where engaged and committed people from all backgrounds want to live, work, play and belong. The Town of Needham is an Affirmative Action / Equal Opportunity Employer, and invites all applicants to submit resumes in confidence.", "num_of_employees": "not-found", "website": "http://needhamma.gov/5372/Career-Opportunities", "industry": "Government Administration", "company_size_approx": "201-500", "headquarters": "Needham, MA", "type": "Government Agency", "founded": "1711"},
{"company_name": "Anglin Reichmann Armstrong, PC", "linkedin_followers_count": 1561, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQGLgpdMKVbxYg/company-logo_200_200/company-logo_200_200/0/1630601629189/anglin_reichmann_snellgrove__armstrong_pc_logo?e=2147483647&v=beta&t=N-oXRHFnbyDAPmXeNlHTdApcxQKJra93QKknn0n6Ztw", "about_us": "Anglin Reichmann Armstrong PC is a 80+ member CPA Firm headquartered in Huntsville, Alabama and an office in Pensacola, Florida. We are one of the 300 largest CPA firms in the country and also one of the 20th largest firms in Alabama.\n\nWe provide Audit and Assurance Services, Tax Advisory Services, and CFO and Consulting Services to business and individual clients. Our industry specialization includes government contracting, information technology, biotechnology, manufacturing, real estate, construction, professional services, health care, hospitality, and nonprofits. We offer accounting system set up and support to the government contractors.  We also provide other specialized consulting and accounting services to the government contracting industry.\n\n\n\n\n\nInvestment advisory services are offered through Avantax Planning PartnersSM. Commission-based securities products are offered through Avantax Investment ServicesSM, Member FINRA (finra.org), SIPC (sipc.org). Insurance services offered through licensed agents of Avantax Planning Partners. The Avantax entities are independent of and unrelated to Anglin Reichmann Armstrong, P.C. Please visit www.avantax.com/social_policy for more information.", "num_of_employees": "not-found", "website": "http://www.anglincpa.com", "industry": "Accounting", "company_size_approx": "51-200", "headquarters": "Huntsville, AL", "type": "Privately Held", "founded": "1990", "specialties": "Information Technology, Government Contracting, Manufacturing, Real Estate & Construction, Biotechnology, Nonprofits, Hospitality, Professional Services, Health Care, Governmental, Estate and Trust Planning, Litigation Support, Forensic Accounting, Home Office Services, Valuation Services, IT Solutions, Peer Review Services, and Research & Development Tax Credit Studies", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "SCM Architects", "linkedin_followers_count": 576, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQHNjza508u9lQ/company-logo_200_200/company-logo_200_200/0/1630569082551/scm_architects_logo?e=2147483647&v=beta&t=fj1t2sFRhG5iHNfQEDMN-9C4PUC8m_4Wpdg-Q_r_7lg", "about_us": "SCM Architects is a unique practice of thorough, considerate, and creative leaders who maintain the relationship between client and architect as fundamental and meaningful to the design and construction process.\n\nSCM Architects is a full-service architectural firm providing master planning, programming, budget/ cost estimating services, code  analysis, site planning and design, schematic design, space planning, interior design, design development, construction documents, specifications, advertisement and bidding, construction contract administration, and post-construction services.\n\nWith offices in Little Rock and Fayetteville, Arkansas, SCM Architects employs thirteen registered architects, four intern architects, and an interior designer, along with two office staff members.\n\nWe are always interested in adding new talent to our studios.  If you are a student, emerging professional, or registered architect interested in learning more about the SCM culture, scroll down to the contact section below to learn how to get in touch with us at our Fayetteville or Little Rock studios.", "num_of_employees": "not-found", "website": "http://www.scmarchitects.com", "industry": "Architecture and Planning", "company_size_approx": "11-50", "headquarters": "Little Rock, AR", "type": "Partnership", "founded": "1985", "specialties": "Architecture, Master Planning, and Interior Design", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "ADW Architects", "linkedin_followers_count": 1398, "company_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQF-Zyzb4IJAZA/company-logo_200_200/company-logo_200_200/0/1722016795469/adw_architects_logo?e=2147483647&v=beta&t=dJZANE2PH6-uiccQJqXSOFHFbWg9lnxb0vgR5QiFb1w", "about_us": "Everything we do is inspired by our belief that spaces shape our lives. Listening and leading with passion, a collaborative spirit, and innovative design solutions, we partner with our clients to transform their visions into meaningful environments for life.\n\nWe believe the built environment inspires the way we live, work, and play. We believe in connecting people to the built environment by creating special places for unique experiences. “Environments for life” refers to all aspects of a person’s life experiences. When we design, all of our focus is on how the built environment will contribute to the enjoyment and quality of life. \n\nUnparalleled customer service begins with listening to our clients’ needs and ideas. Leading with over 45 years of research, experience, and innovations, we offer a proactive approach to insure a project is delivered on time and on budget. We employ a personal touch to providing services that exceed our clients’ expectations. The results are projects that reflect the goals and aspirations of our clients while creating environments that respond to and positively contribute to the community … for life.", "num_of_employees": "not-found", "website": "http://www.adwarchitects.com/", "industry": "Architecture and Planning", "company_size_approx": "11-50", "headquarters": "Charlotte, NC - North Carolina", "type": "Public Company", "founded": "1977", "specialties": "Architecture, Planning, Interior Design, K-12 Education , Higher Education , Civic, Public Safety, Faith-Based, Entertainment, Office + Mixed-Use, and Retail + Restaurant", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Austin Fox Architecture", "linkedin_followers_count": 364, "company_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQFFurxbdoSIvA/company-logo_200_200/company-logo_200_200/0/1722112130773/austin_fox_architecture_logo?e=2147483647&v=beta&t=4QNUGTqH-iQpergVpo9zYrpzQusIo1zmjKalLhDMtaI", "about_us": "We specialize in collaborating with clients to reach the project’s goals. Simultaneously within budgetary limits and fully understanding the need to create commercial, residential and mixed-use environments that produce a valued return on  investment. We believe that each project must be delivered on time and within budgetary limits.", "num_of_employees": "not-found", "website": "af-architect.com", "industry": "Architecture and Planning", "company_size_approx": "2-10", "headquarters": "Fort Lauderdale, Florida", "type": "Privately Held", "specialties": "Architecture, Planning, and Interior Design", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "LUX Speed Capital", "company_logo_url": "https://media.licdn.com/dms/image/v2/D4D0BAQEKrIlNN_dwRg/company-logo_200_200/company-logo_200_200/0/1706820425218?e=2147483647&v=beta&t=EbJDceajkf1ihxzzA66T2tVHnPvpY-q_5eyRRDJMhnI", "about_us": "LUX Speed Capital provides investors with opportunities to claim tax and financial benefits through projects that meet specific requirements of the tax code.", "num_of_employees": "not-found", "website": "luxspeedcapital.com", "industry": "Venture Capital and Private Equity Principals", "company_size_approx": "2-10", "headquarters": "not-found"},
{"company_name": "Pedal Steel Solar", "linkedin_followers_count": 411, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQEJKYyKlpPLtw/company-logo_200_200/company-logo_200_200/0/1686858301287/pedal_steel_solar_logo?e=2147483647&v=beta&t=nrxNalWcjz8eboDDcJ7oEZ3A1wYCvheVIw3dDIjnj2Y", "about_us": "Pedal Steel Solar is a solar development company headquartered in Bentonville, Arkansas. The team comprises energy industry experts with extensive experience in project development, commercial negotiations, market analysis and project finance. Through our solar development activities, we drive infrastructure growth, spur economic development and raise the national profile of the Heartland states.", "num_of_employees": "not-found", "website": "http://pedalsteelsolar.com", "industry": "Solar Electric Power Generation", "company_size_approx": "2-10", "headquarters": "Bentonville, Arkansas", "type": "Privately Held", "founded": "2021", "specialties": "Solar Development, Utility-scale Solar, Renewable Energy Development, Land Acquisition, Permitting, Energy Contracts, Transmission, Development, Engineering, Construction, Land Stewardship, and Asset Management", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "TMP Architecture, Inc.", "linkedin_followers_count": 2504, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQHwKj0uEc7lig/company-logo_200_200/company-logo_200_200/0/1668614270761/tmp_architecture_inc_logo?e=2147483647&v=beta&t=Ppv0hPqRFSYlHbWUpnqN-Z5rOHX-8cNYkoM3Q33f53g", "about_us": "TMP Architecture is a professional firm of creatively focused individuals who specialize in the planning and design of educational facilities for all stages of life. Expertise in learning environments for the arts, sciences, sports and recreation, health and wellness, and media is reinforced by a commitment to client service, project value, and innovative solutions. We commit ourselves to practice rooted in design and technical quality, sustainability, professional ethics, and collaboration.", "num_of_employees": "not-found", "website": "http://tmp-architecture.com", "industry": "Architecture and Planning", "company_size_approx": "51-200", "headquarters": "Bloomfield Hills, MI", "type": "Privately Held", "founded": "1959", "specialties": "Architecture, Interior Design, and Planning", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Trane Technologies", "linkedin_followers_count": 193501, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQH-dHrFPlFFbg/company-logo_200_200/company-logo_200_200/0/1630610252826/tranetechnologies_logo?e=2147483647&v=beta&t=qwPeMs7c5F2az9oCCYgVRYGhPkiYNM40XwRUQJDwRug", "about_us": "Trane Technologies is a global climate innovator advancing sustainability through our leading brands Trane® and Thermo King®, which bring efficient and sustainable climate solutions to buildings, homes and transportation across the globe. Together, we are one team innovating for a better future.\n\nAt Trane Technologies, we are driven by a common purpose: to boldly challenge what’s possible for a sustainable world. While our products and services work to transform climate control, our company’s goal is to combat climate change. Sustainability is embedded in everything we do. Every team member has an impact on our bold 2030 Sustainability Commitments and is empowered to act and bring solutions to life.\n\nOur employee experience sets us apart as a special place to work. We are committed to fostering a culture of inclusivity, innovation and growth. When you join Trane Technologies, you become part of a team that shares a common purpose and values, working together to create a sustainable future. Our core values—Uplift Others, Make an Impact and Thrive at Work and Home—guide us in supporting our community, driving meaningful change and ensuring work-life balance.\n\nExplore our career opportunities and join us as we boldly go.", "num_of_employees": "not-found", "website": "https://www.tranetechnologies.com/en/index.html", "industry": "Industrial Machinery Manufacturing", "company_size_approx": "10,001+", "headquarters": "Davidson, North Carolina", "type": "Public Company", "founded": "2020", "specialties": "Climate Solutions, Sustainability, Efficiency, Climate Change, Innovation, Heating and Cooling, Sustainable Development, Sustainable Employer, Sustainable Brand, Sustainable Investing, Sustainable Business, Green Investing, Green HVAC, Global Warming Solutions, Green Company, and Social Sustainability", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "EightTwenty", "linkedin_followers_count": 1867, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQEKR-cV-nOE8A/company-logo_200_200/company-logo_200_200/0/1643844267461?e=2147483647&v=beta&t=gbtO3IfkfDaC-iiIJtBjdAmlDbarioas1MWZfjkuG1k", "about_us": "We empower people with solar energy.\nWe are a locally owned team of expert carpenters, electricians, project managers, designers, and engineers driven by a shared mission – to empower people with solar energy.", "num_of_employees": "not-found", "website": "http://www.eighttwenty.com", "industry": "Renewable Energy Semiconductor Manufacturing", "company_size_approx": "51-200", "headquarters": "Oklahoma City, Oklahoma", "type": "Privately Held"},
{"company_name": "Bristol Bay Native Corporation", "linkedin_followers_count": 4920, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQHRVAg-l6WwpQ/company-logo_200_200/company-logo_200_200/0/1672940797448/bristol_bay_native_corporation_logo?e=2147483647&v=beta&t=Lr_DijRcUha6sdC3xrXVFoDWU8QKyNmmdg8L3a9jiQM", "about_us": "Bristol Bay Native Corporation (BBNC) is a responsible Alaska Native investment corporation dedicated to the mission of \"Enriching Our Native Way of Life.\" Established through the Alaska Native Claims Settlement Act of 1971 (ANCSA), BBNC works to protect the land in Bristol Bay, celebrate the legacy of its people, and enhance the lives of its shareholders.\n\nWe welcome everyone to our social media channels. We encourage fans to comment and contribute to the conversation. Most importantly, we want everyone to feel comfortable and enjoy our page and the information it can offer so we are asking all fans to abide by our policies:\n\n-Profane language will be immediately deleted.\n-Comments that are insulting, personal or slanderous will be immediately deleted.\n-Comments that are off-topic from the link, post, update can be deleted.\n-Comments that are opposing our viewpoint will NOT be deleted in the spirit of healthy debate. We ask that you disagree respectfully and with the facts.\n-Any spamming to our page will be deleted and fan will be blocked.\n-Those that violate our policies can be deleted or blocked from our fan page.\n\nBBNC’s social media sites and pages are intended to serve as a mechanism for communication between the public and BBNC. All comments posted on BBNC’s social media platforms will be monitored. BBNC reserves the right to remove comments or postings on the website or any social media platform that violate any applicable laws or BBNC’s social media guidelines. Social media sites are private sites and the privacy terms of those sites apply. BBNC does not guarantee reliability and accuracy of any third-party links, and BBNC reserves the right to remove any conversation", "num_of_employees": "not-found", "website": "http://www.bbnc.net", "industry": "Executive Offices", "company_size_approx": "1,001-5,000", "headquarters": "Anchorage, AK", "type": "Privately Held", "founded": "1972", "specialties": "Construction, Industrial Services, Government Services, Tourism, and Seafood", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Morel Construction Co., LLC", "linkedin_followers_count": 66, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQG2lgd9PctVCA/company-logo_200_200/company-logo_200_200/0/1653673607858?e=2147483647&v=beta&t=i8cb7cF_1JLAzTwetRGTbaa-S9Nr_9pq-PdaOGB9Wug", "about_us": "MOREL CONSTRUCTION CO., LLC specializes in the new construction and renovation of commercial, industrial and institutional buildings for clients in both the public and private sectors. Since incorporation in the Commonwealth of Kentucky in August of 1990, MOREL CONSTRUCTION CO., LLC has provided high-quality General Contracting and Construction Management Services throughout the Louisville/Indiana and Northern Kentucky/Greater Cincinnati areas and successfully completed a wide variety of construction projects totaling over $800 Million.", "num_of_employees": "not-found", "website": "http://www.morelconstruction.net", "industry": "Construction", "company_size_approx": "11-50", "headquarters": "Louisville, Kentucky", "type": "Privately Held", "founded": "1990"},
{"company_name": "Aircuity", "linkedin_followers_count": 1812, "company_logo_url": "https://media.licdn.com/dms/image/v2/C510BAQG8hDwmFwqBXA/company-logo_200_200/company-logo_200_200/0/1631375095346?e=2147483647&v=beta&t=7CRNiIYZXb08Bw-d24Za7SVLL037fCn8Je3hNtsEf08", "about_us": "Aircuity is the 20-year leader optimizing ventilation through its patented platform, helping clients decarbonize while improving the indoor environmental quality for occupants. As a result, commercial, institutional and lab building owners can protect occupants, improve employee productivity and wellness, lower operating costs, and verifiably reduce energy use by as much as 60 percent. Headquartered in Newton, MA, Aircuity’s solutions have benefited organizations such as Google, Takeda, SUNY, Eli Lilly, The University of Pennsylvania, and the University of California-Irvine. For additional information on the company and its solutions, please visit: www.aircuity.com.", "num_of_employees": "not-found", "website": "http://www.aircuity.com", "industry": "Environmental Services", "company_size_approx": "11-50", "headquarters": "Norwood, Massachusetts", "type": "Privately Held", "founded": "2000", "specialties": "Providing significant energy savings, continuously monitoring facilities'​ indoor environmental quality, delivering intelligent insight into building performance, helping to reduce carbon emissions, indoor air quality, healthier facilities, and optimize ventilation rates", "funding": "US$ 6.2M", "funding_total_rounds": 12, "funding_option": "Series unknown", "last_funding_round": "May 3, 2015"},
{"company_name": "Genz & Associates, LLC", "linkedin_followers_count": 866, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQH0Qxsu7A90AQ/company-logo_200_200/company-logo_200_200/0/1631325310428?e=2147483647&v=beta&t=9xxREkkxCRX2AECXfRW2YS-U6P8g8H-kO7s9zY9amtY", "about_us": "Established in 2011, Genz & Associates is a leading buy-side mergers and acquisitions advisory firm with offices in Austin, Los Angeles, and Phoenix. Our core focus is partnering with leading investors seeking to deploy capital into industry-specific platform investments, add-on/strategic acquisitions, and buy-and-build strategies. Since its founding, the firm has closed 110+ transactions with an enterprise value exceeding $3.5+ billion.", "num_of_employees": "not-found", "website": "http://www.genzassociates.com", "industry": "Investment Banking", "company_size_approx": "11-50", "headquarters": "Austin, Texas", "type": "Privately Held", "founded": "2011"},
{"company_name": "WDD Architects", "linkedin_followers_count": 362, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQH6iDzSagqLbA/company-logo_200_200/company-logo_200_200/0/1630437653210?e=2147483647&v=beta&t=y_jqFj-Fw4camM18MLxJBhCE069owCcwZRP8RG07I-o", "about_us": "Our team is comprised of architects, interior designers, space planners, and contract administrators. Our firm has been serving the State of Arkansas since 1919, with a rich history of iconic architecture around our state.\n\nWe have an extensive portfolio of projects largely in the fields of municipal, education, healthcare, office space and corrections projects. These projects range from Little Rock Central High School (1926) to Arkansas Heart Hospital Encore Medical Center (2021).", "num_of_employees": "not-found", "website": "https://wddarchitects.com/", "industry": "Architecture and Planning", "company_size_approx": "11-50", "headquarters": "North Little Rock, Arkansas", "type": "Privately Held", "founded": "1919", "specialties": "architecture, interior design, education, master planning, and healthcare", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Home Run Financing (formerly PACE Funding Group)", "linkedin_followers_count": 963, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQF4lvj4Y0pWyg/company-logo_200_200/company-logo_200_200/0/1630654944347/home_run_financing_logo?e=2147483647&v=beta&t=Pu7KkQlSahb1uVG3aI0wyrQhnEpuO-j_v199WZ--HN0", "about_us": "Home Run Financing provides value to homeowners through our fixed-rate Property Assessed Clean Energy (PACE) financing product. We work closely with approved contractors to ensure a quick and easy quoting and underwriting process for the homeowner.\n\nContractors:  Home Run Financing provides contractors with the most efficient software toolset to generate more business and save you time.\n\nHomeowners: Save money on your energy bills! Cities and Counties in your state now offer an affordable way to invest in home energy improvements.\n\nMunicipalities: Help your communities develop a sustainable future by making energy efficient choices that are safe and affordable for property owners.\n\nPACE Funding Group, LLC is licensed in California to provide PACE Funding:\n\nCalifornia Department of Financial Protection and Innovation (DFPI) – License number 60DBO-91769\n\nPFG Lending, LLC is licensed in the following States to provide Home\nRun Loans:\n\nCalifornia\nCalifornia Department of Financial Protection and Innovation (DFPI) – License number 60DBO - 138794\n\nFlorida\nFlorida Office of Financial Regulation – License number SF9901932\n\nMissouri\nMissouri Division of Finance – License number 510-23-8900\n\nKansas\nKansas Office of the State Bank Commissioner – License number SL.0026816", "num_of_employees": "not-found", "website": "http://homerunfinancing.com", "industry": "Financial Services", "company_size_approx": "51-200", "headquarters": "Los Gatos, California", "type": "Privately Held", "founded": "2010"},
{"company_name": "Skyview Ventures", "linkedin_followers_count": 2176, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQFN0PmQvTlc-g/company-logo_200_200/company-logo_200_200/0/1630657109862/skyview_ventures_logo?e=2147483647&v=beta&t=u5Y4bTxnFjVQQ3ol60rx3ZOvAikMyDJU7raVnuWDwDo", "about_us": "Skyview Ventures is a management company that was founded in December 2008 to pursue investment opportunities in renewable energy and energy efficiency.  Our investments fall along four themes: environmental commodities; distributed generation; electric vehicle infrastructure; and early-stage startups.  We have built a community of clean energy technology companies in related industries that can leverage each other’s insights and experiences.  For more information please visit our website.", "num_of_employees": "not-found", "website": "http://skyviewventures.com/", "industry": "Venture Capital and Private Equity Principals", "company_size_approx": "11-50", "headquarters": "Nashville, TN", "type": "Privately Held", "founded": "2008"},
{"company_name": "Traverse City Light & Power", "linkedin_followers_count": 758, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQFvQW-6TrVxew/company-logo_200_200/company-logo_200_200/0/1630627814855/traversecitylightpower_logo?e=2147483647&v=beta&t=by8G3j-Ip_5_Q5q-xZphQ7U1HFY79NJ1O3wkHkARAoE", "about_us": "Traverse City Light & Power is a community-owned, municipal electric utility providing reliable, affordable energy since 1912. We now offer TCLPfiber, an all-fiber, gigabit internet service for a more connected community.", "num_of_employees": "not-found", "website": "http://tclp.org", "industry": "Utilities", "company_size_approx": "11-50", "headquarters": "Traverse City, Michigan", "type": "Government Agency", "founded": "1912"},
{"company_name": "Davis Hill Development", "linkedin_followers_count": 1996, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQFd3LKIStTjdw/company-logo_200_200/company-logo_200_200/0/1630646149588?e=2147483647&v=beta&t=ZQsfPO3-W4l48vly9yuSUm16NhFojIAbz8Om1SlTNsc", "about_us": "Davis Hill Development partners with organizations of all sizes to power their clean energy needs. Our partnerships start with the understanding that sourcing clean energy is not our partners’ focus, and our processes ensure that they can access renewable energy while focusing on their core business objectives. DHD is a subsidiary of Skyview Ventures, a clean technology investment company. Skyview has investments in a portfolio of technology companies providing innovating solutions. DHD is the development arm of Skyview and is tasked with developing pilot or demonstration projects for a number of these innovative technologies.", "num_of_employees": "not-found", "website": "https://davishilldevelopment.com/", "industry": "Renewable Energy Semiconductor Manufacturing", "company_size_approx": "11-50", "headquarters": "Nashville, Tennessee", "type": "Privately Held"},
{"company_name": "State of Wisconsin", "linkedin_followers_count": 47089, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQGCfjf8gheb4A/company-logo_200_200/company-logo_200_200/0/1630562305404/state_of_wisconsin_logo?e=2147483647&v=beta&t=_bnWOUTnA8KNHPfqZ8Zxl5mVzCYmJX1zs2K7HeeNolQ", "about_us": "Welcome to the official LinkedIn page for Wisconsin State Government! We are an Equal Opportunity Employer seeking a diverse and talented workforce. This is the \"company page\" you will be connected with if you choose \"State of Wisconsin\" as your current employer, or if you're following us to keep up to date on professional opportunities in the public sector.\n\nHelpful State Government Websites:\nState Jobs: http://Wisc.Jobs\nState of Wisconsin homepage: http://www.wisconsin.gov", "num_of_employees": "not-found", "website": "http://wisc.jobs", "industry": "Government Administration", "company_size_approx": "10,001+", "headquarters": "Madison, WI", "type": "Government Agency", "founded": "1848", "specialties": "government, state, wisconsin, jobs, public administration, workforce development, madison, milwaukee, Information Technology, Agriculture, Science, Education, Law Enforcement, Economics, Law, and Engineering", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Novele", "linkedin_followers_count": 446, "company_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQFIowcEcaDMWA/company-logo_200_200/company-logo_200_200/0/1725409905723/novele_logo?e=2147483647&v=beta&t=gxuxZfOn0H_gub2_NrTOJNJzOEgUWvteiXIJybnTa-c", "about_us": "At Novele, we’re on a mission to create a world where energy not only powers our lives but also sustains our planet and enriches our communities.\n\nOur innovative technology merges cutting-edge hardware with advanced machine learning to optimize energy management right at the point of consumption. Through our decentralized and forward-thinking energy network, we deliver customizable, flexible solutions that provide peace of mind and certainty as our clients' energy needs evolve.\n\nThe Novele EnergyBoard System integrates distributed energy storage using our safe, space-saving, and scalable platform with intelligent software that enhances energy efficiency, boosts resilience, and delivers significant cost savings. Most importantly, our innovative energy management system is designed for wall-mounted interior placement and actively reduces building carbon emissions, making a tangible contribution to a more sustainable future.", "num_of_employees": "not-found", "website": "http://www.novele.com", "industry": "Computers and Electronics Manufacturing", "company_size_approx": "11-50", "headquarters": "Brooklyn, NY", "type": "Privately Held", "founded": "2015", "specialties": "Innovative energy storage, software, design, Real Estate tech, IoT, PoE, and digital infrastructure", "funding": "not-found", "funding_total_rounds": 2, "funding_option": "Seed", "last_funding_round": "Dec 15, 2023"},
{"company_name": "5 Architecture", "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQE8Cbg2QYHaQA/company-logo_200_200/company-logo_200_200/0/1652817779237/5architecture_logo?e=2147483647&v=beta&t=GbNYTZecmSALUGWAQwYBHhsnYHhi0pwducynxM3FE18", "about_us": "We build strong relationships where our knowledge and expertise are used to help our client’s projects flourish and grow. We expose the potential bound within our clients vision to produce a space that supports their dream. \n\nThrough our built work, we hope to spark engagement and excitement.", "num_of_employees": "not-found", "website": "http://www.5architecture.com", "industry": "Architecture and Planning", "company_size_approx": "2-10", "headquarters": "Boca Raton", "type": "Partnership", "founded": "2018", "specialties": "Educational Architecture, Institutional Architecture, Retail Architecture, Restaurant Architecture, and Commercial Interiors", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "National Renewable Energy Laboratory", "linkedin_followers_count": 239403, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQHz9rVt6gu5LQ/company-logo_200_200/company-logo_200_200/0/1665062608850/national_renewable_energy_laboratory_logo?e=2147483647&v=beta&t=V6a6EhMynrlJs3GyFv0UbPGkRUXFcS-ZDREJPYKVgss", "about_us": "The National Renewable Energy Laboratory (NREL), a Department of Energy national lab, is #TransformingEnergy as the nation's primary laboratory for renewable energy and energy efficiency research and development.\n\nNREL's Mission: NREL develops renewable energy and energy efficiency technologies and practices, advances related science and engineering, and transfers knowledge and innovations to address the nation's energy and environmental goals.\n\nNREL's Strategy: NREL has forged a focused strategic direction to increase its impact on the U.S. Department of Energy's (DOE) and our nation's energy goals by accelerating the research path from scientific innovations to market-viable alternative energy solutions.", "num_of_employees": "not-found", "website": "http://www.nrel.gov", "industry": "Research Services", "company_size_approx": "1,001-5,000", "headquarters": "Golden, CO", "type": "Nonprofit", "founded": "1977", "specialties": "Renewable Energy, Energy Efficiency, Research and Development, Basic Science, Solar, Photovoltaics, Wind, Biofuels, and Energy Systems Integration", "funding": "not-found", "funding_total_rounds": 11, "funding_option": "Grant", "last_funding_round": "Oct 4, 2024"},
{"company_name": "Japan Electric Power Information Center, USA", "linkedin_followers_count": 105, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQEPz8w9zu9nWA/company-logo_200_200/company-logo_200_200/0/1649702805278?e=2147483647&v=beta&t=lxdosMSR52DnwmFUisZvRx0L1LLQz_O-z4TMyK4Fq9k", "about_us": "Japan Electric Power Information Center, USA (JEPIC-USA) is a 501(c)(3) nonprofit organization established in 2017. \n\nWe aim to be a hub of research and international information exchange- enabled by our sister offices in Tokyo, Paris, and Beijing- with a focus on electric power and broader energy and environmental issues for the benefit of the general public in the United States, Japan, and other countries.\n\nJEPIC-USA tracks and analyzes relevant developments in the U.S. energy and environmental sectors, such as policy agendas, electricity power markets, regulations, and private sector business models, in order to better inform the Japanese industry and government. However, our efforts also aim to share Japanese advancements with the US.\n\nWe believe we can enhance communication channels and build partnerships across country borders and among the industry influencers, enabling them to create a future where energy systems are increasingly efficient, affordable, sustainable, and secure.", "num_of_employees": "not-found", "website": "https://www.jepic-usa.org/", "industry": "Non-profit Organizations", "company_size_approx": "2-10", "headquarters": "Washington, District of Columbia", "type": "Nonprofit", "founded": "2017"},
{"company_name": "Energy Optimizers, USA", "linkedin_followers_count": 601, "company_logo_url": "https://media.licdn.com/dms/image/v2/C510BAQHrQQ4j9Q6Gig/company-logo_200_200/company-logo_200_200/0/1630573217760/energy_optimizers_usa_logo?e=2147483647&v=beta&t=w1NGlWX7sPnkxe0PexSb5zQJdk0VhWS7yFn_WWzVQRg", "about_us": "Facility improvements and energy efficiency  projects including LED lighting retrofits, HVAC upgrades, building automation upgrades, renewable energy projects and educational energy awareness programs.  The company specializes in Design-Build projects, as well as PACE projects for commercial/industrial facilities.", "num_of_employees": "not-found", "website": "http://www.energyoptusa.com", "industry": "Facilities Services", "company_size_approx": "11-50", "headquarters": "Dayton, Ohio", "type": "Privately Held", "founded": "2009"},
{"company_name": "Coalition for Green Capital", "linkedin_followers_count": 6688, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQFRf0pF5QYq7Q/company-logo_200_200/company-logo_200_200/0/1630652491004/coalition_for_green_capital_logo?e=2147483647&v=beta&t=8CP-hfHYBgIVDE5dCX8st5Y4zyktbfzCgK8wg5YXZnQ", "about_us": "The Coalition for Green Capital (CGC), a non-profit, is a leading expert and advisor on Green Banks and related clean energy finance and deployment entities. \n\nGreen Banks are a proven finance model that uses public and philanthropic funds to mobilize private investment in renewable energy, energy efficiency and other decarbonization technologies. For over a decade, the Coalition for Green Capital has led the Green Bank movement, working at the federal, state and local level in the United States and in countries around the world. \n\nBy increasing investment and accelerating the construction of clean power, the Coalition for Green Capital is helping deliver a cleaner, better future.", "num_of_employees": "not-found", "website": "http://www.coalitionforgreencapital.com", "industry": "Capital Markets", "company_size_approx": "2-10", "headquarters": "Washington, D.C.", "type": "Nonprofit", "founded": "2009", "specialties": "Green Banks, Legislation, Environmental Policy, Economic Modeling, and Clean Energy Finance", "funding": "US$ 5.0B", "funding_total_rounds": 1, "funding_option": "Grant", "last_funding_round": "May 4, 2024"},
{"company_name": "National Cooperative Bank", "linkedin_followers_count": 14224, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQGkJgHuRQqyLQ/company-logo_200_200/company-logo_200_200/0/1630647577264/national_cooperative_bank_logo?e=2147483647&v=beta&t=CPy8DJLIOf7a_rdlcZmwz9dpBhu5HMdYrXsxL-7M6rI", "about_us": "National Cooperative Bank is a values-based bank serving cooperatives, member organizations and socially responsible people with a special emphasis on low income areas. \nServing both rural and urban neighborhoods, NCB is a leader in supplying grocery, health care, energy and housing solutions to the nation’s communities that are most in need.  What makes NCB unique is that the bank was created to address the financial needs of an underserved market niche – people who join together cooperatively to meet personal, social or business needs, especially in low-income communities. \n\nOur Impact\nNCB has provided billions in capital.  Yet, to measure our true success, we look to what we have helped create over our history -- thousands of homeownership opportunities, vital member-owned cooperative businesses, community choices in education, quality health care facilities, renewable energy solutions, cultural centers and much more.\n\nOur Work Environment \nAs a boutique bank with a special commitment to community, NCB attracts a team of professionals interested in “more than just a banking career.” \n\nOur Cooperative Heritage\nCooperatives are based on the values of self-help, self-responsibility, democracy and member-equity.   In the tradition of our founders, cooperatives believe in conducting business in a responsible, ethical, and honest manner with the foremost commitment to improve the quality of life in the communities we serve.\n\nOur Benefits and Our People\nAt National Cooperative Bank, our people are our greatest asset. We are committed to providing a comprehensive benefits package that can be broken down into four categories: health, wealth, self, and extras. From offering Health Care Plans that include medical, dental, vision, disability, and life insurance to offering several alternative work arrangements, NCB is proud to offer a variety of benefits that promote employee wellness and success.", "num_of_employees": "not-found", "website": "http://www.ncb.coop", "industry": "Banking", "company_size_approx": "201-500", "headquarters": "Arlington, VA", "type": "Privately Held", "founded": "1978", "specialties": "Banking and Financial Services, Cooperative Expansion, Economic Development, Socially Responsible Banking, Commercial Lending , Commercial Real Estate , Cash Management , Lockbox & Payment Processing , and Correspondent Banking", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Ava Community Energy", "linkedin_followers_count": 4238, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQFwbwK2tcQUQA/company-logo_200_200/company-logo_200_200/0/1698102518097/ebce_logo?e=2147483647&v=beta&t=fvkfxAaTOkXtmUvR13_hK8jOdDEEtHjyeOowkitgaso", "about_us": "Ava Community Energy (Ava) is the local, not-for-profit electricity supplier powering Alameda County and the City of Tracy (electricity service to the Cities of Stockton and Lathrop will begin in April 2025). Ava provides clean, green energy at low rates to our 640,000 customers. We reinvest earnings back into the community to create local green energy jobs, local programs, and clean power projects.\n\nAva member cities include Albany, Berkeley, Dublin, Emeryville, Fremont, Hayward, Livermore, Newark, Oakland, Piedmont, Pleasanton, San Leandro, Stockton, Tracy, and Union City. The unincorporated areas of Alameda County (including Ashland, Castro Valley, Cherryland, Fairview, San Lorenzo, and Sunol) are also served by Ava.", "num_of_employees": "not-found", "website": "http://avaenergy.org/", "industry": "Utilities", "company_size_approx": "51-200", "headquarters": "Oakland, California", "type": "Government Agency", "founded": "2016", "specialties": "solar, wind, renewable energy, battery storage, community, and public power", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Renewable America", "linkedin_followers_count": 4746, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQFMV0mHhsp5kQ/company-logo_200_200/company-logo_200_200/0/1645749404135/renewam_logo?e=2147483647&v=beta&t=fjgjQ83qabvbc3hs6faZoYdl5Qykmfh0UlPNioPMmG0", "about_us": "Renewable America's mission is to become a leading provider of Distributed Energy Resources, serving communities with small utility-scale, locally-generated solar plus storage facilities, and resilient microgrids that fit into the distribution grid.", "num_of_employees": "not-found", "website": "http://www.renewableamerica.com", "industry": "Solar Electric Power Generation", "company_size_approx": "11-50", "headquarters": "Santa Clara, California", "type": "Privately Held", "founded": "2020", "specialties": "Resilient Microgrids, Solar Power, and Energy Storage", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "IOWN", "linkedin_followers_count": 5000, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQHgx8GT_fLsgg/company-logo_200_200/company-logo_200_200/0/1646422272008/iown_renewable_energy_inc_logo?e=2147483647&v=beta&t=Rk5xC7UQidqzWkZOLl4IrgxkdDqApjIKaQ56FCi0eEQ", "about_us": "We want to facilitate the transition from fossil fuels to clean, renewable energy. IOWN Renewable Energy Inc. develops renewable energy projects from infancy to feasibility. We strive to be the leading team in the development, engineering, procurement, finance, construction, and selling of top-tier renewable energy assets.\n\nWe invest resources into projects, people, and ideas where we believe we can make a difference and where there is a mutual benefit for the planet, people, and business. We are building the new energy future.\n\nWe fight to keep you cool.\nThat's cool.", "num_of_employees": "not-found", "website": "https://www.iownrenewable.com/", "industry": "Renewable Energy Semiconductor Manufacturing", "company_size_approx": "11-50", "headquarters": "La Jolla, California", "type": "Privately Held", "founded": "2014", "specialties": "Wind Power, Venture Capital, Solar, Energy Storage, Financing, Battery Energy Storage, Asset Management, Renewable Energy, Renewables, Project Development, Investments, Solar Energy, Solar Power, Alternative Energy, and Project Construction", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Lawrence Group", "linkedin_followers_count": 11188, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQHlVPq_vAadTg/company-logo_200_200/company-logo_200_200/0/1706715059984/the_lawrence_group_logo?e=2147483647&v=beta&t=eJDaeNi3dwzR0XqkDNaIGF5hIQwMQfMD5ItrcYI7w2A", "about_us": "Lawrence Group is a best-in-class design firm using the power of people with great ideas to bring clients’ dreams to life. Founded in 1983, we offer architecture, interior design, master planning, landscape architecture and furniture procurement services to clients across the country.", "num_of_employees": "not-found", "website": "http://www.thelawrencegroup.com", "industry": "Architecture and Planning", "company_size_approx": "51-200", "headquarters": "Saint Louis, MO", "type": "Privately Held", "founded": "1983", "specialties": "Architecture, Interior Design, Master Planning, Landscape Architecture, and Furniture Procurement", "funding": "not-found", "funding_total_rounds": 3, "funding_option": "Debt financing", "last_funding_round": "Dec 23, 2016"},
{"company_name": "Prairie Engineers, P.C.", "linkedin_followers_count": 1393, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQGrANIi7E3CWw/company-logo_200_200/company-logo_200_200/0/1695397371964/prairie_engineers_pc_logo?e=2147483647&v=beta&t=6BSXIpfRydisAFdYzFUwz4LnL765U3Uqvtmv4YkBopY", "about_us": "Our “can-do” culture is what consistently defines our company with both our clients and our team members.  We’re responsive, flexible, and people focused, building a robust and cohesive team along with a strong network of teaming partners while delivering top notch service to our clients.", "num_of_employees": "not-found", "website": "http://www.prairieengineers.com", "industry": "Civil Engineering", "company_size_approx": "51-200", "headquarters": "Columbia, Illinois", "type": "Privately Held", "founded": "2010", "specialties": "Land Surveying, Environmental Science, Civil Engineering, Geospatial, Mechanical Engineering, Electrical Engineering, Structural Engineering, Facilities, Infrastructure, and Site Civil Design", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Harding, Shymanski & Company, P.S.C.", "linkedin_followers_count": 3406, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQEZtHEppw1dsw/company-logo_200_200/company-logo_200_200/0/1644936944965/harding_shymanski__company_psc_logo?e=2147483647&v=beta&t=g1Tu6cjcB6b1wqqPr7_Mhz5miItfX_63TkF53HxeSbM", "about_us": "Harding, Shymanski & Company, P.S.C. is a public accounting firm with offices in Evansville, Indiana, and Louisville, Kentucky. We are one of the largest accounting firms in Southern Indiana and Kentucky, providing experienced professionals who look beyond the numbers to the heart of complex issues.\n\nOur clients range in size from small proprietorships to billion-dollar corporations, from closely-held and family-owned businesses to publicly traded firms. They span nearly every industry: finance, communications, construction, mining, manufacturing, nonprofit, wholesale, retail, transportation, government, health care, and service. They all have one thing in common: they count on our expertise to capitalize on their opportunities and make the best of their challenges.\n\nInvestment advisory services are offered through Avantax Planning Partners℠. Commission-based securities products are offered through Avantax Investment Services℠, Member FINRA (www.finra.org), SIPC (www.sipc.org). Insurance services offered through licensed agents of Avantax Planning Partners℠. 3200 Olympus Blvd., Suite 100, Dallas, TX 75019. The Avantax entities are independent of and unrelated to Harding, Shymanski & Company, P.S.C. Although Avantax does not provide or supervise tax or accounting services, our Financial Professionals may offer these services through their independent outside business. Not all Financial Professionals are licensed to offer all products or services. Financial planning and investment advisory services require separate licenses. Please visit https://www.avantax.com/social_policy/ for more information.", "num_of_employees": "not-found", "website": "http://www.hsccpa.com", "industry": "Accounting", "company_size_approx": "51-200", "headquarters": "Evansville, Indiana", "type": "Privately Held", "founded": "1975", "specialties": "Public Accounting, Auditing, Taxation, Payroll, Valuation, Manufacturing, Construction, Healthcare, Nonprofits, Internal Audit, Loan Review, Fraud Hotline, Forensic Accounting, Litigation Support, Retirement Plan Administration, Employee Benefit Plan Audits, and ESOPs", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "dGEN Energy Partners, Inc", "linkedin_followers_count": 845, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQEos551yn7V9Q/company-logo_200_200/company-logo_200_200/0/1719249293294/dgen_energy_partners_logo?e=2147483647&v=beta&t=yRH5c_anIY-YJkPoZDCEWu2THSt5PUb4PkYBXNxmyl8", "about_us": "At dGEN Energy Partners, we are driven by a singular mission: to make solar energy and roofing solutions viable for businesses through strategic partnerships. Our dedicated team of developers and engineers has deployed over 750MW of renewable energy and provided expert roofing services, demonstrating our commitment to environmental stewardship and technological innovation.\n\nWe are proud to have contributed to nearly 25% of IKEA’s solar installations and have extensive experience in managing comprehensive roofing projects, including insurance claims processing. Our reach extends nationally, as well as, multiple countries, reflecting our broad impact and expertise.\n\nAs the chosen engineering team behind UPS America’s solar initiatives and the exclusive Solar Services Provider for WW Grainger, we have a proven track record of excellence in delivering tailored solar and roofing solutions.\n\nPartner with dGEN Energy Partners today to explore bespoke energy and roofing solutions that drive value and sustainability for your business.", "num_of_employees": "not-found", "website": "https://www.dgenenergy.com/", "industry": "Solar Electric Power Generation", "company_size_approx": "11-50", "headquarters": "Sheridan, WY", "type": "Privately Held", "founded": "2015", "specialties": "Commercial Solar, Industrial Solar, Microgrids, Solar Development, Solar Financing, Batteries, Solar Power, Renewable Energy, Electric Vehicle Charging, and Commercial Roofing", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Silfab Solar Inc.", "linkedin_followers_count": 16019, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQFlDRnpl8A6Tw/company-logo_200_200/company-logo_200_200/0/1630672371496/silfab_ontario_inc__logo?e=2147483647&v=beta&t=8FmYFPvdsRl1qpqEdZYw5lJRMrpAxgLaxipI2px7P98", "about_us": "Silfab Solar is the North American leader in the design, development, and manufacture of high-efficiency, premium-quality solar modules. Silfab leverages more than 40 years of solar experience and best-in-class technologies to produce the highest-rated solar modules in the industry. Silfab operates state-of-the-art facilities in Washington, USA, and Fort Mill, South Carolina, manufacturing solar cells and PV modules. All our locations feature multiple automated production lines, certified ISO 9001:2015 Quality Management Systems, and just-in-time manufacturing to deliver Buy American-approved PV modules specifically designed for and dedicated to the North American market.\n\nVisit www.silfabsolar.com for more information.", "num_of_employees": "not-found", "website": "http://www.silfabsolar.com", "industry": "Renewable Energy Semiconductor Manufacturing", "company_size_approx": "501-1,000", "headquarters": "Mississauga, Ontario", "type": "Privately Held", "founded": "2010", "specialties": "Solar PV, Bifacial, Custom manufacturing Solutions, and High efficiency PV modules", "funding": "US$ 50.0M", "funding_total_rounds": 5, "funding_option": "Private equity", "last_funding_round": "Dec 21, 2024"},
{"company_name": "Barr Engineering Co.", "linkedin_followers_count": 19837, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQFRmGJtNMQL3g/company-logo_200_200/company-logo_200_200/0/1709576342444/barr_engineering_co_logo?e=2147483647&v=beta&t=zet5uNdnjkcps4zyfLOM_GJ88e-1FXzf_AKBjINnduc", "about_us": "Barr provides engineering and environmental consulting services to clients across the Midwest, throughout the Americas, and around the world. We have been employee-owned since 1966 and trace our origins to the early 1900s. Working together, our 1,000+ engineers, scientists, and technical specialists help clients develop, manage, and restore natural resources. \n\nBarr’s project teams work with clients in industries such as power, refining, mining, and manufacturing as well as attorneys, government agencies, and natural-resource-management organizations. Our project sites range from iron-ore mines in South America to wind-power farms in South Dakota, from manufacturing facilities in California to oil-sands fields in western Canada.\n\nBarr is an EEO employer. For more about who we are and what we do, please visit our website at www.barr.com", "num_of_employees": "not-found", "website": "https://www.barr.com", "industry": "Professional Services", "company_size_approx": "1,001-5,000", "headquarters": "Minneapolis, Minnesota", "type": "Privately Held", "founded": "1966", "specialties": "engineering and design of structures and processes, environmental management and compliance assistance, water resources management assistance, and assessment and remediation of contaminated sites", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Valley Electric Association, Inc.", "linkedin_followers_count": 649, "company_logo_url": "https://media.licdn.com/dms/image/v2/C510BAQET8pFhk75PlA/company-logo_200_200/company-logo_200_200/0/1631440714201?e=2147483647&v=beta&t=s3_4YbyBKwJeAMXgRXsvac3u-XIEifP4QDKGu7eDlKM", "about_us": "Valley Electric Association (VEA) is a member-owned electricity/communications cooperative headquartered in Pahrump. It is among the fastest growing Co-ops in the country.\n \nValley's service area covers more than 6,800 square miles of rural Nevada and parts of California and includes 24,000 meters with 2,200 miles of distribution and 360 miles of transmission lines.\n \nThe 53-year-old Co-op moved aggressively into the high-speed communications business in 2016, creating the first all-optical-fiber community in Nevada. Valley Communications Association is bringing broadband to rural areas that would have little hope of obtaining it otherwise. The backbone of that network is the electric infrastructure built by Valley Electric Association. By piggybacking on the reliable cabling and lines already in place, VCA is able to provide the fastest, most reliable Internet service. Our long-term goal is to position VCA, a wholly owned subsidiary of VEA, to work with other Co-ops in Nevada to bring high-speed communications to the rural areas of the state.\n \nEarlier in 2016, VCA formed a partnership with Switch to connect its Las Vegas SUPERNAP data center ecosystems in southern Nevada to those in northern Nevada using VEA's fiber infrastructure. \n \nVEA joined the California Independent System Operators Corporation (CAISO) in 2013, which is creating opportunities for transmitting electricity from solar generation in Nye County to the California market. That partnership helped VEA experience a 40-percent revenue growth during the past six years.\n \nIn September 2016, VEA went live with a 15-megawatt solar generation project, which will use 54,000 photovoltaic solar panels covering more than 80 acres in Pahrump. The program will allow VEA consumers to enjoy the benefits of renewable energy without the investments and deals that those who have solar panels of their own set up.\n \nVEA is home of the largest domestic solar water heater program in the nation.", "num_of_employees": "not-found", "website": "http://www.vea.coop", "industry": "Utilities", "company_size_approx": "51-200", "headquarters": "Pahrump, Nevada", "type": "Nonprofit", "founded": "1965", "specialties": "Utility Company, Communications Company, Transmission Company, and Energy Company", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Electric Power Engineers", "linkedin_followers_count": 17458, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQHtxDRHRHeaxw/company-logo_200_200/company-logo_200_200/0/1670515718386/epeconsulting_logo?e=2147483647&v=beta&t=fq7FWsM-Lr5Vb3bXdgnd6uXRZsZFS5sJNXIY7hzWlb0", "about_us": "A leader in grid reliability and resiliency, Electric Power Engineers (EPE) has partnered with power and energy clients across the globe for over 50 years. EPE’s client-centric approach delivers unmatched expertise throughout the project lifecycle, with a platform of comprehensive services and proprietary solutions spanning utility engineering, grid and resource integration, reliability and compliance, digitalization, and grid analytics, as well as innovative software partnership with its sister company ENER-I.AI, Inc. \n\nCommitted to designing and developing the grid of the future, EPE’s highly experienced team of detail-oriented consultants are passionate about helping clients address complex engineering and grid modeling challenges, bridge gaps, and gain visibility into the evolving complexities of the grid. Learn more about EPE at epeconsulting.com", "num_of_employees": "not-found", "website": "https://epeconsulting.com/", "industry": "Utilities", "company_size_approx": "201-500", "headquarters": "Austin, Texas", "type": "Privately Held", "founded": "1968", "specialties": "Engineering consulting, Transmission planning, Engineering management, Distribution, Wind energy, Solar Power, Renewable generation, Interconnection Agreements, GIS, Electrical design, Transmission grid evaluation, Plant design, and Locational Marginal Pricing", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Perspectus Architecture", "linkedin_followers_count": 2074, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQFq292zWDS5rg/company-logo_200_200/company-logo_200_200/0/1642453982394/perspectus_architecture_logo?e=2147483647&v=beta&t=Ho_CVgzCm1SCLUbXE3Que2RfmbDdlj1Tw0nMkV8Oy_Q", "about_us": "Perspectus is an award-winning architectural design firm delivering creative solutions in master planning, design and project management for healthcare, campus + culture, senior living, historic, civic +  government, clubs + hospitality, laboratory and commercial projects.\n\nHeadquartered in Cleveland, Ohio, Perspectus serves clients throughout the Eastern United States, and we pride ourselves on leadership, communication and reliability. \n\nThrough a shared understanding of the process and goals, we connect design and innovation and embrace each client’s vision to create quality projects aligning strategy, architecture and planning.", "num_of_employees": "not-found", "website": "https://perspectus.com/", "industry": "Architecture and Planning", "company_size_approx": "11-50", "headquarters": "Cleveland, Ohio", "type": "Privately Held", "founded": "2003", "specialties": "Architectural Design, Interior Design, Healthcare, Historic, Civic/ Government, Laboratory/ Technology, Senior Living, Education, Corporate/ Commercial, and Clubs/ Hospitality", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Clearway Energy Group", "linkedin_followers_count": 46702, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQEcd3y98-Rmmw/company-logo_200_200/company-logo_200_200/0/1630645189404/clearway_energy_group_logo?e=2147483647&v=beta&t=zH9IBx2Z1YJo1VCsfp7ZGhfy5xyvcPXBcmj69TnrDv4", "about_us": "Clearway Energy Group is leading the transition to a world powered by clean energy. Along with our public affiliate Clearway Energy, Inc., our portfolio comprises approximately 11.4 GW of gross generating capacity in 26 states, including 9 GW of wind, solar, and energy storage assets, and over 2.4 GW of conventional dispatchable power generation providing critical grid reliability services. As we develop a nationwide pipeline of new energy projects for the future, Clearway’s fleet of emissions-free assets generates enough reliable electricity to power more than 2 million homes today. Clearway Energy Group is headquartered in San Francisco with offices in Denver, Houston, Phoenix, Princeton, and San Diego. For more information, visit clearwayenergygroup.com.", "num_of_employees": "not-found", "website": "https://www.clearwayenergygroup.com/", "industry": "Renewable Energy Power Generation", "company_size_approx": "501-1,000", "headquarters": "San Francisco, California", "type": "Privately Held", "founded": "2018"},
{"company_name": "Legacy Bank and Trust", "linkedin_followers_count": 1162, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQHG9_w9yqQOIA/company-logo_200_200/company-logo_200_200/0/1680723851704?e=2147483647&v=beta&t=d3MSqZTw-323xc5MisuipySGhisK27G2gt_X2HC27rY", "about_us": "Since Legacy Bank and Trust first bank opened its doors in 1907, our\nvision has been to surpass standards in banking for our customers as well as local\nbusinesses so they have the ability to help our communities thrive. Through a dedication to\ninnovation, local growth, and building strong relationships with people like you, we hope to\nmake every customer one for life.\n\nConnect with us!\nFacebook: https://www.facebook.com/legacybankandtrust/\nInstagram: https://www.instagram.com/legacybankandtrust/\nTwitter: https://twitter.com/LegacyBankTrust \n\nLegacy Bank and Trust is a Member FDIC and Equal Housing Lender.", "num_of_employees": "not-found", "website": "https://www.legacybankandtrust.com/", "industry": "Banking", "company_size_approx": "51-200", "headquarters": "Springfield, Missouri", "type": "Privately Held", "founded": "1907"},
{"company_name": "Altman + Barrett Architects", "linkedin_followers_count": 324, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQGZQAr4B-ZB6g/company-logo_200_200/company-logo_200_200/0/1707249795532/altmanbarrettarchitects_logo?e=2147483647&v=beta&t=O3REgrOdqI_t8bMEuPbx1OzCDpdDgNaYE993IFSkB08", "about_us": "Altman + Barrett has developed a strong reputation for delivering high quality projects. Our extensive experience illustrates the ability to form and maintain successful long term business relationships. From new construction to renovations, the building process can be complicated and challenging - experience is key. Our goal is to provide our client a facility that functions seamlessly, is on time, and under budget.", "num_of_employees": "not-found", "website": "https://www.altmanbarrettarchitects.com/home", "industry": "Architecture and Planning", "company_size_approx": "11-50", "headquarters": "Hahira, GA", "type": "Partnership", "founded": "2006", "specialties": "Architecture, Interior Design, Master Planning, Preservation, Engineering, Restoration, and Renovation", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "BB+M Architecture", "linkedin_followers_count": 3226, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQFYL7S-bKZ1rQ/company-logo_200_200/company-logo_200_200/0/1630625847680/bb_m_architecture_logo?e=2147483647&v=beta&t=IxaxearXDy-OY23DFnJdfjr2ru5ac3DsgYt0GTIvmW8", "about_us": "A Charlotte-based firm offering comprehensive planning, architectural and interior design services.\n\nFounded in 2005, our design work at BB+M reflects an underlying belief in contextual response to building site, program and client experience. Excellent design solutions, however, begin with great clients and an interactive design approach, led by firm principals, ensures a focus on project vision. Our relentless commitment to design delivery and great customer service is simply the foundation of the practice.  We offer big firm capacity with small firm service. Design doesn’t need to be hard – we are easy to do business with and offer a balance of conceptual design, strong execution and lack of ego.  We know it’s all about you.\n\nBB+M Architecture’s projects are quite diverse with a particular focus on Office, Multifamily, Hospitality, Senior Living, Retail, Mixed-Use, and Adaptive Reuse developments ranging from $1-100MM in value.", "num_of_employees": "not-found", "website": "http://www.bbm-arch.com", "industry": "Architecture and Planning", "company_size_approx": "51-200", "headquarters": "Charlotte, North Carolina", "type": "Partnership", "founded": "2005", "specialties": "Architecture, Planning, Interior Design, and Sustainability", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Hussung Mechanical Contractors, Inc. / HMC Service Company", "linkedin_followers_count": 1105, "company_logo_url": "https://media.licdn.com/dms/image/v2/C510BAQGRYchZjWaR8A/company-logo_200_200/company-logo_200_200/0/1631362313241?e=2147483647&v=beta&t=E4ZOkv18x9HrBy2kXUZDpptEe7c0RzEE-wWJXZnStNM", "about_us": "The Team at HMC is a regional leader specializing in energy solutions, building automation, mechanical construction, design/build construction,  HVAC, plumbing, process piping, and mechanical service, for  commercial, industrial, health care and institutions. We are a LEED certified contractor and members of the Kentucky Chapter of the USGBC. \r\n\r\nSince 1966, HMC’s business has been built upon a solid foundation of satisfied customers and dedicated employees. As an industry leader specializing in commercial and industrial applications, Hussung Mechanical Contractors and HMC Service Company has steadily grown in size and capabilities.\r\n\r\nAs we soar towards the future, we remain committed to establishing long-term relationships with our customers by fostering a “no bad job” culture, willing to sacrifice profit for customer satisfaction.", "num_of_employees": "not-found", "website": "http://www.hussung.com", "industry": "Construction", "company_size_approx": "201-500", "headquarters": "Louisville, KY", "type": "Self-Owned", "founded": "1966", "specialties": "Energy Solutions, Heating, Air Conditioning, Refrigeration, Plumbing, Process Piping, Mechanical Construction, Mechanical Service, Building Automation, Boilers, Chillers, Geo Thermal, Medical Gas Piping, Ventilation, Design Build Construction, and Plan and Spec Construction", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Ragona Architecture & Design", "linkedin_followers_count": 766, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQGjmJ8A1pmFvQ/company-logo_200_200/company-logo_200_200/0/1630643242374/ragona_architecture__design_logo?e=2147483647&v=beta&t=IeVClrkSJQ1GiP5pWb6C6AfOXWHvAPvd5IVSwD7uQb0", "about_us": "Creative 3D Solutions for your Real Estate Needs.\n\nIt's a whole lot less about us and our designs than it is about our clients and their projects.  We know that a project has to work on a spreadsheet before it works on an easel, and that it has to work for tenants and their customers before it works for the project's owner.  We take great care to focus on what will make sense in the market before we ever begin to draw a solution.\n\nRagona Architecture & Design (RAD) is an innovative architecture firm that keeps up with all of the latest design tools and technology in the industry. From concept to construction, we create all of our work using 3D software (Revit). This allows us to produce all of the construction drawings required to build a project in an efficient and coordinated way. Additionally, by having our work in 3D, we can help owners visualize and market their projects using computer generated renderings and animations.\n\nOne of the things that sets RAD apart from other firms utilizing Revit for production is that each of our project managers is Revit/BIM proficient.  This allows our best staff members to navigate, review, and update the project model in real time.  This means that your project manager will be working to produce your documents alongside the team rather than directing changes through redlines and sketches.  As a result, RAD’s project managers have a more in depth understanding of their projects which increases the response time of all of our decisions.  There is also no “hand off” to construction administrative staff at RAD; your project manager will continue to work through CA to deliver your successful project.  RAD has been able to leverage this business model to both reduce schedules and fees for our clients.", "num_of_employees": "not-found", "website": "http://www.rad-arch.com", "industry": "Architecture and Planning", "company_size_approx": "11-50", "headquarters": "Charlotte, North Carolina", "type": "Privately Held", "founded": "1975", "specialties": "Master Planning for Facilities and Communities, Mixed-Use Development, Retail Development, Project Management and Construction Administration, Wellness, Interior Design, Automotive, Hospitality, Malls, Restaurant, Office, Fitness, Specialty Services, and Graphic Design", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "EMPOWERED ENERGY SYSTEMS LCA", "linkedin_followers_count": 62, "company_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQHprQYm9QmLEQ/company-logo_200_200/company-logo_200_200/0/1715809790598/empowered_energy_systems_llc_logo?e=2147483647&v=beta&t=thupjUnU8pIrhGI3ehNmqijk968HLbCGuEPSALo6xfo", "about_us": "Empowered Energy Systems is located in Hotchkiss, CO and has been serving our Western Slope Communities with custom solar PV  system design, installations and maintenance since 2004.  Our company has a reputation for high quality work and excellent customer service.  We install grid-tied, grid-tied with battery back-up, and off-grid PV electric systems with the goal of helping our customers enjoy substantial savings through the use of the sun’s energy. We offer financing that is straight forward with no hidden “dealer fees” and also work with businesses and agricultural producers.\n Empowered Energy Systems is a Worker-Owned Cooperative and a Public Benefit Corporation. Please visit our web page at EmpoweredEnergySystems.com to learn more.\nEmpowered Energy Systems, LCA -  Solar Solutions as Sure as the Sun!", "num_of_employees": "not-found", "website": "http://empoweredenergysystems.com", "industry": "Renewables & Environment", "company_size_approx": "2-10", "headquarters": "Hotchkiss, Colorado", "type": "Public Company", "founded": "2004", "specialties": "PV System design and installation", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Kim Hardesty CPA", "linkedin_followers_count": 2, "company_logo_url": "https://static-exp2.licdn.com/aero-v1/sc/h/cs8pjfgyw96g44ln9r7tct85f", "about_us": "1369 Highway 44 E", "num_of_employees": "not-found", "website": "not-found", "industry": "2-10 employees", "company_size_approx": "Shepherdsville,"},
{"company_name": "Delta G Consulting Engineers", "linkedin_followers_count": 135, "company_logo_url": "https://static-exp2.licdn.com/aero-v1/sc/h/cs8pjfgyw96g44ln9r7tct85f", "about_us": "External link for Delta G Consulting Engineers", "num_of_employees": "not-found", "website": "http://www.deltag.net", "industry": "Mechanical Or Industrial Engineering", "company_size_approx": "11-50", "headquarters": "Fort Lauderdale, FL"},
{"company_name": "City of Los Angeles", "linkedin_followers_count": 93452, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQHLJlNJiANGxA/company-logo_200_200/company-logo_200_200/0/1630666252649/city_of_los_angeles_logo?e=2147483647&v=beta&t=fAwOjWZ6JMCO8GoTYPGwE7bFqNSxqd9MYxMy9ugCOGQ", "about_us": "The City of Los Angeles employs more than 45,000 people in a wide range of careers. Visit our website for information on current openings, including regular civil service positions, exempt and emergency appointment opportunities, in addition to internships!\n\nThe City of Los Angeles is a Mayor-Council-Commission form of government, as originally adopted by voters of the City of Los Angeles, effective July 1, 1925, and reaffirmed by a new Charter effective July 1, 2000. A Mayor, City Controller, and City Attorney are elected by City residents every four years. Fifteen City Council members representing fifteen districts are elected by the people for four-year terms, for a maximum of two terms. Members of Commissions are generally appointed by the Mayor, subject to the approval of the City Council. General Managers of the various City departments are also appointed by the Mayor, subject to confirmation by the City Council. Most employees of the City are subject to the civil service provisions of the City Charter.", "num_of_employees": "not-found", "website": "https://linktr.ee/CityLAJobs", "industry": "Government Administration", "company_size_approx": "10,001+", "headquarters": "Los Angeles, California", "type": "Government Agency"},
{"company_name": "Copia Power", "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQELqOalXbJdzg/company-logo_200_200/company-logo_200_200/0/1630663463871/copia_power_logo?e=2147483647&v=beta&t=ZlECqrmFmhpj41TsZ4uNMjiGCW4VdhnTNVCoycXmXGU", "about_us": "Copia Power is an energy transition company committed to developing, constructing and owning large-scale infrastructure assets in the U.S. to accelerate decarbonization in all areas of our economy. Copia Power is actively developing more than 15 GW of solar and energy storage projects in the US.  Copia Power is backed by Carlyle, one of the world’s largest global investment firms.", "num_of_employees": "not-found", "website": "http://www.copiapower.com", "industry": "Renewable Energy Semiconductor Manufacturing", "company_size_approx": "51-200", "headquarters": "not-found", "type": "solar energy, renewable energy, developer, operator, land acquisition, interconnection, permitting, and capital markets"},
{"company_name": "Hoefer Welker", "linkedin_followers_count": 7729, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQE8hECigDNsmA/company-logo_200_200/company-logo_200_200/0/1630512918865/hoefer_wysocki_architects_llc_logo?e=2147483647&v=beta&t=iHKNr1upKOCjnuqUzPGQ4q8Ud9M49Ob2aZe1Mrgs-r0", "about_us": "Founded in 1996, Hoefer Welker is a full-service design firm offering architecture, interior design, MEP engineering, and medical equipment planning and technology consulting. We serve clients in healthcare, higher education, government and commercial sectors across the U.S., bringing diversified expertise to every job.", "num_of_employees": "not-found", "website": "http://www.hoeferwelker.com", "industry": "Architecture and Planning", "company_size_approx": "51-200", "headquarters": "Kansas City, Missouri", "type": "Privately Held", "founded": "1996", "specialties": "Architectural Design, Interior Design, Master Planning, Programming, Design Documentation, Land Planning Services, Needs Assessment, Construction Administration, Post Occupancy Evaluation, Cost Projection/Schedule, Peer & Document Review, Initial Outfitting, Sustainable Design, and Mechanical, Electrical, Plumbing Engineering", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Pathward", "linkedin_followers_count": 20915, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQEZoRfSvYdZlQ/company-logo_200_200/company-logo_200_200/0/1692822456601/pathward_logo?e=2147483647&v=beta&t=yygyuS9x4nRfGlsrnRTboIDhTezt3BDoH8f65Gm4PVw", "about_us": "At Pathward, expanding financial access is the heart of our business. We work with diverse partners to deliver Banking-as-a-Service and commercial finance solutions for clients and customers that the traditional financial system can’t or won’t fully serve.  \n\nTogether, we are powering financial inclusion for more because we believe in financial inclusion for all.", "num_of_employees": "not-found", "website": "https://www.pathward.com/", "industry": "Financial Services", "company_size_approx": "1,001-5,000", "headquarters": "Sioux Falls, South Dakota", "type": "Public Company", "founded": "1954"},
{"company_name": "US Solar", "linkedin_followers_count": 4918, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQGQGf2NEyXSDA/company-logo_200_200/company-logo_200_200/0/1634131059231/ussolarcorporation_logo?e=2147483647&v=beta&t=mOu6JH3Q3kT3T78qYh8pTajSZG_x73yCMAe_3xItFok", "about_us": "United States Solar Corporation (“US Solar”) is a developer, owner, operator, and financier of solar generation projects, with a focus on community solar programs.   \n\nWe seek to make solar energy accessible with simple, money-saving, long-term solutions that are as good for the wallet as they are for the environment. \"Subscribe\" to the benefits of an offsite solar system without the investment or hassle of an onsite system.\n\nOur platform is comprised of best-in-class providers from the first stages of development through successful construction.", "num_of_employees": "not-found", "website": "https://www.us-solar.com/", "industry": "Renewable Energy Semiconductor Manufacturing", "company_size_approx": "11-50", "headquarters": "Minneapolis, Minnesota", "type": "Privately Held", "founded": "2014", "specialties": "Community Solar, Solar Project Finance, Solar Project Development, Real Estate Acquisition, and solar", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Solops, LLC", "linkedin_followers_count": 365, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQHXJBPE39Hn5Q/company-logo_200_200/company-logo_200_200/0/1630575003296/solops_llc_logo?e=2147483647&v=beta&t=Ix7GoVaoGg2bREnm1WZvbOi5RBtk_ophF-hM1i1sdeg", "about_us": "Solops, a Denham Capital company, founded in 2010, is a premier developer, financier, and owner/operator of photovoltaic solar projects in the commercial and industrial sectors (C&I) throughout the United States. The Solops team has collectively developed over 3GW of projects in the C&I sector and closed on financings in excess of $2.1 billion dollars. The Company has established relationships and strategic partnerships with industry leading solar integration companies, developers, engineering firms, brokerage houses, private equity funds, hedge funds, large investment banks, and regional lending institutions.", "num_of_employees": "not-found", "website": "http://www.solops.com", "industry": "Financial Services", "company_size_approx": "2-10", "headquarters": "Hamilton Township, New Jersey", "type": "Privately Held", "founded": "2010"},
{"company_name": "Bernhard", "linkedin_followers_count": 31206, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQFORlMHYh5VfQ/company-logo_200_200/company-logo_200_200/0/1630608031893/bernhard_llc_logo?e=2147483647&v=beta&t=gn968vHiOruSWM25Rr7TaUQFiNuKJpDGYqhYbWovZz0", "about_us": "Bernhard is an energy infrastructure firm headquartered in New Orleans, LA. Founded in 1919, Bernhard’s core services span the US and include engineering, fabrication, construction, asset management, and energy-as-a-service for customers in healthcare, higher education, hospitality, industrial, and other market segments. Bernhard has over 2,200 full-time employees in more than 20 U.S. offices.", "num_of_employees": "not-found", "website": "http://www.bernhard.com", "industry": "Utility System Construction", "company_size_approx": "1,001-5,000", "headquarters": "Metairie, Louisiana", "type": "Privately Held", "founded": "1919", "specialties": "Energy, Engineering, Energy As A Service, Energy Optimization, Facility Management, Commissioning, Retro-commissioning, Mechanical Construction, Electrical Engineering, Plumbing, MEP, Mechanical, Electrical, & Plumbing, Engineering, and Energy Performance Contracting", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "The Indianapolis Public Library", "linkedin_followers_count": 3903, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQGKuPnnIaY8ZA/company-logo_200_200/company-logo_200_200/0/1712755130138/indianapolispubliclibrary_logo?e=2147483647&v=beta&t=zq4HiG94MX6K1YHAy1P-ofweWWE3VgY1LCkzi6ufgAM", "about_us": "The Indianapolis Public Library is the community's place to access essential information resources, technology, programs and services; foster reading and learning and promote the social, economic, recreational and lifelong learning interests of its diverse population.", "num_of_employees": "not-found", "website": "http://www.indypl.org", "industry": "Libraries", "company_size_approx": "501-1,000", "headquarters": "Indianapolis, Indiana", "type": "Nonprofit", "founded": "1873", "specialties": "Public Library", "funding": "US$ 622.1K", "funding_total_rounds": 1, "funding_option": "Grant", "last_funding_round": "Jun 17, 2023"},
{"company_name": "Michigan State Police", "linkedin_followers_count": 18260, "company_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQGBN9Pr-enPxg/company-logo_200_200/company-logo_200_200/0/1727790147853/michiganstatepolice_logo?e=2147483647&v=beta&t=umqircEuyLvatps1E6ZZW7A2XQPhf5Xn5yaWNm2n2Ho", "about_us": "The Michigan State Police is a modern-day force of law enforcement professionals who use high tech equipment and state-of-the-art technology to provide 24-hour statewide police service.  Along with our counterparts at the local, county and federal levels of government, we are working diligently to prevent crime, apprehend fugitives, improve traffic safety, ensure homeland security, provide quality support services and to maintain basic police services for our local communities.", "num_of_employees": "not-found", "website": "http://www.michigan.gov/msp", "industry": "Law Enforcement", "company_size_approx": "1,001-5,000", "headquarters": "Dimondale, MI", "type": "Government Agency", "founded": "1917", "specialties": "Serving the public with Excellence, Integrity, and and Courtesy since 1917", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "District of North Vancouver", "linkedin_followers_count": 5319, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQE2jgE6Bh3Ucw/company-logo_200_200/company-logo_200_200/0/1726071632030/district_of_north_vancouver_logo?e=2147483647&v=beta&t=H2e5YKWJh_e6HSKopdqh1NcHStab1crf5naax892r-E", "about_us": "Stretching from Deep Cove in the east to the Capilano River Canyon in the west, we are an innovative municipal government that maintains and enhances the quality of life for our residents and businesses.\n\n A flexible, family-friendly employer with an inclusive workplace culture, we offer exciting career options, professional development opportunities, and a competitive salary and benefits package. \n\nCome and contribute to making the District of North Vancouver a great place to live, work and play for generations to come.", "num_of_employees": "not-found", "website": "http://www.dnv.org/careers", "industry": "Government Administration", "company_size_approx": "501-1,000", "headquarters": "North Vancouver, BC", "type": "Government Agency"},
{"company_name": "California Community Power", "linkedin_followers_count": 250, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQHyJHOuihIlvQ/company-logo_200_200/company-logo_200_200/0/1695843338451?e=2147483647&v=beta&t=PPZMxNuM1my4-2_PFj7pqzMpiD20wlP_jia5XEXtb8I", "about_us": "California Community Power (CC Power) is a Joint Powers Agency comprised of nine California Community Choice Aggregators (CCAs).\n\nCC Power allows its member CCAs to combine their buying power to procure new, cost-effective clean energy and reliability resources to continue advancing local and state climate goals. CC Power members represent over 2.7 million customers across 112 municipalities spanning from Humboldt County to Santa Barbara County.", "num_of_employees": "not-found", "website": "https://cacommunitypower.org/", "industry": "Services for Renewable Energy", "company_size_approx": "2-10", "headquarters": "Sacramento, CA", "type": "Government Agency", "founded": "2021"},
{"company_name": "Genesis Hightech", "company_logo_url": "https://media.licdn.com/dms/image/v2/D4D0BAQFXY0dFVxpvKw/company-logo_200_200/company-logo_200_200/0/1724665494161/genesis_hightech_logo?e=2147483647&v=beta&t=3D_KwcLkKBBIRuHaO7KV62FgVCGmo8IKcQ65a0QuapQ", "about_us": "We specialize in Artificial Intelligence (AI), Internet of Things (IoT), and Big Data, pioneering solutions that redefine industry norms. Our dedicated team of experts is committed to shaping the future through cutting-edge technologies", "num_of_employees": "not-found", "website": "https://genesishightech.com/", "industry": "IT System Custom Software Development", "company_size_approx": "2-10", "headquarters": "Muscat", "type": "Privately Held", "founded": "2023"},
{"company_name": "NextEra Energy, Inc.", "linkedin_followers_count": 116777, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQEEtpPCEPTVcw/company-logo_200_200/company-logo_200_200/0/1682449295652/nextera_energy_inc_logo?e=2147483647&v=beta&t=C0Xw6sZWa6BCJWG04qswlNYlfHq31YQ1iL7Tt1eGC3U", "about_us": "We’re the world's largest generator of renewable energy from the wind and sun and a world leader in battery storage. We own Florida Power & Light Company, America's largest electric utility, and NextEra Energy Resources, LLC, a competitive clean energy business.  \n\nAre you ready to help us define the next era of energy? Learn about career opportunities and join our talent community by visiting: https://jobs.nexteraenergy.com/", "num_of_employees": "not-found", "website": "http://www.nexteraenergy.com", "industry": "Utilities", "company_size_approx": "10,001+", "headquarters": "Juno Beach, FL", "type": "Public Company", "specialties": "Renewable Energy, Clean Energy, Fortune's list of World's Most Admired Companies 2019, Forbes America's Best Employers 2018, and Ethisphere Institute's World's Most Ethical Company 2019", "funding": "$73.62", "funding_total_rounds": 3, "funding_option": "Post IPO debt", "last_funding_round": "Mar 27, 2024"},
{"company_name": "Hope  Community Capital LLC", "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQH7jOBznqW8Ng/company-logo_200_200/company-logo_200_200/0/1631330630651?e=2147483647&v=beta&t=X4KPrbKzJARs9ld6DjVSXp-1aOiNd9UJHnaJ2vCJ2qg", "about_us": "Hope Community Capital (HOPE) cultivates sustainable, equitable and thriving communities by connecting community development projects with financing, and investors with impact opportunities. HOPE is an expert with the intricate process of identifying, accessing, and structuring the financial support to enable successful community development projects. HOPE has extensive experience garnering support for and connecting communities with diverse sources of funding that brings community-driven hope into reality through sustainable development.\r\n\r\nAreas of expertise:\r\n>Identifying and securing innovative sources of capital \r\n>Structuring complex financing \r\n>Bringing diverse funding partners together\r\n>Financial planning for long term sustainability\r\n>Developing project budgets\r\n>Building multi-year operating projections \r\n>Working with stakeholders at all levels of government, business, foundations, nonprofits and community leadership to advance sustainable projects", "num_of_employees": "not-found", "website": "http://www.hopecommunitycapital.com", "industry": "Financial Services", "company_size_approx": "2-10", "headquarters": "Madison", "type": "Self-Owned", "founded": "2016", "specialties": "Community Development Finance, New Markets Tax Credits, and Sustainable Development", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Generation Solar", "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQEvaBO0Gt2pOg/company-logo_200_200/company-logo_200_200/0/1670006790588/generation_solar_us_logo?e=2147483647&v=beta&t=gmdL7YFrwCgeQvn0cuBg0DK0vBLG0HgGjug09VX3Xzo", "about_us": "In the solar industry, \"on-the-job-training\" too often means putting junior team members in a position to make avoidable, and very expensive mistakes. Generation Solar was created to help fill our growing industry's massive experience gap. We pair one-on-one coaching from experienced solar professionals with a fun, technology-enabled, highly interactive, and empirically-supported educational program to turn solar newbies into solar savants 10x faster. Using workshops, courses, and custom games, we teach and coach budding solar professionals into having the on-the-ground good judgment that usually only comes from extensive experience.", "num_of_employees": "not-found", "website": "generationsolar.us", "industry": "Professional Training and Coaching", "company_size_approx": "2-10", "headquarters": "not-found", "type": "2022"},
{"company_name": "HelmsBriscoe", "linkedin_followers_count": 39071, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQECXge7WR5EQQ/company-logo_200_200/company-logo_200_200/0/1631314906640?e=2147483647&v=beta&t=ZYnMgt_ixvPUrjraooLSoaeEF1QQaRDrPM3bwWzVq8Q", "about_us": "As the global leader in hotel site selection and the placement of meetings and events, HelmsBriscoe streamlines the meeting planning process by managing the time-consuming task of researching, contacting, and evaluating venues for your organization’s events. Since 1992, HelmsBriscoe clients have benefited from our global reach, unsurpassed experience, and industry relationships. \n\nWhether you are booking a large-scale association event, or a smaller corporate function, our team of industry professionals will work to match your meeting with the best venue at the best value based on your specific needs.\n\nFor more information, please contact our global headquarters at info@helmsbriscoe.com or 480.718.1111", "num_of_employees": "not-found", "website": "http://www.helmsbriscoe.com", "industry": "Hospitality", "company_size_approx": "1,001-5,000", "headquarters": "Scottsdale, Arizona", "type": "Privately Held", "founded": "1992", "specialties": "site selection, event planning, meetings, conferences, and incentives", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Elective", "linkedin_followers_count": 4505, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQGP-1UslqpGow/company-logo_200_200/company-logo_200_200/0/1690641211180/wizebank_co_logo?e=2147483647&v=beta&t=bfJaj84Bw9K79_CNKHDUI36U7O80uPRBzx2NWjRhcyg", "about_us": "Elective is a VC-backed FinTech startup in the creator economy. We're bringing our collective experiences working with some of the world's leading online education businesses to arm the most ambitious and demanding creators with the software and financial services they require to build, manage, and grow their education empires.", "num_of_employees": "not-found", "website": "https://www.elective.com", "industry": "Financial Services", "company_size_approx": "11-50", "headquarters": "Vancouver, BC", "type": "Privately Held", "founded": "2020"},
{"company_name": "Avisen Legal", "linkedin_followers_count": 445, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQHmoK7HHaRl9Q/company-logo_200_200/company-logo_200_200/0/1631363477817?e=2147483647&v=beta&t=B8xid3M17zS_aGzKpkSVD1CV2i2bllPHfN__H2dvDBk", "about_us": "Our lawyers joined together based on a shared belief in an entrepreneurial law firm.  Some left large law firms and some came from in-house general counsel backgrounds.  Everyone provides clients with the high level of legal expertise they expect and the level of personal commitment they deserve. \n\nWe work on sophisticated and complex matters.  Technology enables us to work effectively and efficiently together and with you.  We know that highly experienced lawyers, with the right tools, provide the highest level of expertise and care without extravagant overhead. \n\nThe result was our mission - Boutique Big Law.\n\nWhat do we do? We focus on representing businesses, business-owners, investment funds and non-profits on the legal issues that relate to the formation, operation, growth and sale of their businesses. \n\nIf you are starting up a business, fund or non-profit, hiring or firing employees, negotiating contracts, raising capital to make it grow, building a plant, buying other companies, selling your company or need to set up your estate to take care of the next generation, we are here for you and we want to help.\n\nWe average over 20 years of experience per attorney, so we have seen and done most things.  We use our experience to achieve your goals effectively and efficiently.  We also leverage the same technologies used by larger law firms to prepare documents and research the law.  When needed, we partner with other high quality law firms, either in specific practice areas (even equine law if needed) or locations to get you the results you need.  We answer our own phones and respond to our own emails.  We add paper to the printer.  We do what it takes to serve you.\n\nAt Avisen Legal, we take pride and joy in seeing our clients succeed.  We also take pride and joy in helping each other succeed.  We believe this makes us better lawyers and that means better results for you.", "num_of_employees": "not-found", "website": "https://avisenlegal.com/", "industry": "Law Practice", "company_size_approx": "2-10", "headquarters": "Minneapolis, MN", "type": "Privately Held", "founded": "2017", "specialties": "Employment Law, Mergers & Acquisitions, Corporate Law & Governance, Licensing, Nonprofit, Social Ventures & Cooperatives, Contracts, Trade Secrets & Intellectual Property Protection, Securities, Medical Practice Employment & Transitions, and Sales & Acquisitions of Real Estate", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Fredrikson & Byron, P.A.", "linkedin_followers_count": 6931, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQHz1reH9sy9GA/company-logo_200_200/company-logo_200_200/0/1669905637627/fredrikson__byron_p_a__logo?e=2147483647&v=beta&t=5aB4MJPjqag6FtJz8jPnxAReSWHboh_gkk55XIYc558", "about_us": "At Fredrikson, we’ve built a reputation as the firm “where law and business meet” by bringing business acumen and entrepreneurial thinking to our work with clients, and by operating as business advisors and strategic partners as well as legal counselors.\n\nA proactive, problem-solving mindset runs throughout our service areas, from our traditional legal areas of support like litigation, real estate, and intellectual property to our more consultative practices like government relations. It’s a mindset that enables us to understand and keep client objectives firmly in mind, and to anticipate and address problems before they arise.\n\nOur lawyers blend a common sense approach with in-the-field experience, and we utilize our firm’s strong reputation and our lawyers’ broad networks of business and industry contacts to get things done for clients.\n\nClients have relied on us since 1948 for great solutions that help them minimize legal risks and maximize business benefits. We look forward to an opportunity to show you what it is like where law and business meet. \n  \nFredrikson & Byron, P.A. was founded in Minneapolis in 1948.  Since then, we’ve grown into an international firm of over 350 attorneys in over 30 practice areas.", "num_of_employees": "not-found", "website": "http://www.fredlaw.com", "industry": "Law Practice", "company_size_approx": "501-1,000", "headquarters": "Minneapolis, Minnesota", "type": "Privately Held", "founded": "1948"},
{"company_name": "City of San José", "linkedin_followers_count": 31091, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQGhaOLU0OQTbg/company-logo_200_200/company-logo_200_200/0/1630479863378/cityofsanjose_logo?e=2147483647&v=beta&t=dKaLFIMhSi2LeYITpUIrSQr7EcYih4IdGRlUmqm-VJo", "about_us": "From its founding in 1777 as California's first city, San José has been a leader driven by its spirit of innovation. Today, San José stands as the largest city in Northern California and the Capital of Silicon Valley—the world's leading center of technology innovation.  San José is the 10th largest in the U.S., and is committed to remaining a top-ranked place to do business, work, live, play and learn.\r\n\r\nSan José is located in Santa Clara County at the southern edge of the San Francisco Bay, about 50 miles south of San Francisco, 390 miles north of Los Angeles. The local weather is hard to beat with moderate year-round temperatures. Residents enjoy 300 days of sunshine each year and an average annual temperature of 70 degrees.\r\n\r\nThe City of San José operates under the council-manager form of government, a system that combines the policy leadership of elected officials in the form of a city council, with the managerial expertise of an appointed city manager.", "num_of_employees": "not-found", "website": "http://www.sanjoseca.gov/", "industry": "Government Administration", "company_size_approx": "5,001-10,000", "headquarters": "San José, CA", "type": "Government Agency", "founded": "1777", "specialties": "Building Inspection, Code Enforcement, Economic Development, Environmental Services, Finance, Green Building, Housing, Information Technology, Planning, Public Safety, Public Works, Recycling, Transportation, Zero Waste, Aviation, Parks & Recreation, Library, and Animal Care", "funding": "US$ 260.0K", "funding_total_rounds": 2, "funding_option": "Grant", "last_funding_round": "Sep 1, 2024"},
{"company_name": "Neumann Monson Architects", "linkedin_followers_count": 2537, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQG6T1z7zfjZNQ/company-logo_200_200/company-logo_200_200/0/1630591354620/neumann_monson_architects_logo?e=2147483647&v=beta&t=1qsO3fcBitooYSXTF6VNdMtmyjHWj8aflRwN8n5-Fi4", "about_us": "What if every act of architecture made the world a better place? At Neumann Monson, this question animates every project we undertake. We believe architecture has the power to empower people, cultivate communities, and protect natural resources. Our goal is to make this potential a reality through thoughtful, relevant, and sustainable design solutions. We are the stewards of your vision, helping you live your mission and drive positive change.", "num_of_employees": "not-found", "website": "http://www.neumannmonson.com", "industry": "Architecture and Planning", "company_size_approx": "11-50", "headquarters": "Iowa City, Iowa", "type": "Privately Held", "founded": "1977", "specialties": "Architecture, Interior Design, Sustainable Design, LEED, and Structural Engineering", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Genesys", "company_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQG21iObgGNbnw/company-logo_200_200/company-logo_200_200/0/1724940378043/genesys_geo_logo?e=2147483647&v=beta&t=mBvcfl14GRlIaUjneKXSabl1eKngI_kgH2DUy4Bamac", "about_us": "Genesys is a clean technology company that offers an innovative geothermal solution to reduce your carbon emissions and operational expenses. Our proprietary CLAD technology leverages stable water temperatures underground for efficient and sustainable heat transfer. Genesys delivers a seamless heating and cooling system customized to the unique needs of your project.", "num_of_employees": "not-found", "website": "https://www.genesysgeo.com/", "industry": "Renewable Energy Equipment Manufacturing", "company_size_approx": "2-10", "headquarters": "not-found", "type": "Geothermal and Energy Efficiency"},
{"company_name": "Kansas Department of Administration", "linkedin_followers_count": 400, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQE-11yHo-JNaQ/company-logo_200_200/company-logo_200_200/0/1729180296541/kansas_department_of_administration_logo?e=2147483647&v=beta&t=a6E-xIMrN-W_v0EzDPfMzTlqMBrRM6zhZY8Wq-r6XR4", "about_us": "The Kansas Department of Administration is a service agency that was established in 1953.  Under the direction of the Office of the Secretary of Administration, the Department provides statewide guidance and leads the enterprise by modeling teamwork and cost-effective business practices.\n\nThe Department of Administration consists of the Office of the Secretary, Office of Chief Counsel, Office of Accounts and Reports, Office of Facilities and Property Management, Office of Financial Management, Office of Public Affairs, Office of Personnel Services, Office of Printing and Surplus, Office of Procurement and Contracts, Office of Systems Management and the Division of State Employee Health Plan.", "num_of_employees": "not-found", "website": "http://admin.ks.gov", "industry": "Government Administration", "company_size_approx": "201-500", "headquarters": "Topeka, Kansas", "type": "Government Agency"},
{"company_name": "Trico Electric Cooperative", "linkedin_followers_count": 2193, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQE8sAbwAbBGEQ/company-logo_200_200/company-logo_200_200/0/1630640528736/trico_electric_cooperative_logo?e=2147483647&v=beta&t=nutvUI3j1aPQYF4q8hBCXjhTJ8gkBo_KKXwzFYcgmeg", "about_us": "Trico Electric Cooperative Inc. is a non-profit electric distribution cooperative serving more than 45,000 Members in rural areas surrounding the City of Tucson, including portions of Pima, Pinal, and Santa Cruz counties. Formed in 1945, Trico is owned by the people it serves.", "num_of_employees": "not-found", "website": "http://www.trico.coop", "industry": "Utilities", "company_size_approx": "51-200", "headquarters": "Marana, AZ", "type": "Nonprofit", "founded": "1945", "specialties": "Not-for-profit electric cooperative", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Duncan Toys Company", "linkedin_followers_count": 345, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQGiy8c2DsNbRQ/company-logo_200_200/company-logo_200_200/0/1630567866122/duncan_toys_company_logo?e=2147483647&v=beta&t=pAB-l60T2TLqmEqTpVNPqZaXoDUi4KhWxGDm6gmqLqA", "about_us": "Since 1929, Duncan® Toys has been putting smiles on the faces of its customers with its legendary assortment of yo-yos and other skill toys.\n\nToday, Duncan® is one of the world’s largest and most recognized toy makers with a full line of products ranging across all major categories.\n\nFounded during the Great Depression, Duncan® has always embodied curiosity and invention that could only be fueled by the uniquely entrepreneurial spirit of America. Customers trust the Duncan name and know it brings with it a promise of quality, craftsmanship and tremendous value.\n\nFrom schoolyard demonstrators selling hand-carved wooden yo-yos, to modern world champions touring the globe, the way we play is always changing, but the reasons we play are not.\n\nDuncan® is committed to engaging children of all ages and all generations with high-quality toys. Whether you are shopping for your child or for your own inner child, we believe our toys will help you find your inner fun.", "num_of_employees": "not-found", "website": "http://duncantoys.com", "industry": "Retail", "company_size_approx": "11-50", "headquarters": "Middlefield, Ohio", "type": "Privately Held", "founded": "1929"},
{"company_name": "LIUNA", "linkedin_followers_count": 9293, "company_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQHGMLm8FNlUzA/company-logo_200_200/company-logo_200_200/0/1667497269213/liuna_logo?e=2147483647&v=beta&t=LV2Fpkp9JzWDKhKsEii905_tfSDal7wSuG3lHNkekoY", "about_us": "This is the official LinkedIn page for LIUNA. LIUNA—the Laborers’ International Union of North America—is the most progressive, aggressive and fastest-growing union of construction workers, and one of the most diverse and effective unions representing public service employees. \r\n\r\nLIUNA members are on the forefront of the construction industry – a sector that is a powerhouse of 12 million workers producing 5 percent of our countries’ economic output.\r\n \r\nA half-million strong, we are united through collective bargaining agreements which help us earn family-supporting pay, good benefits and the opportunity for advancement and better lives.", "num_of_employees": "not-found", "website": "http://www.liuna.org/", "industry": "Construction", "company_size_approx": "5,001-10,000", "headquarters": "Washington, DC", "type": "Nonprofit", "founded": "1903"},
{"company_name": "Collective Clean Energy Fund", "linkedin_followers_count": 1085, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQFkBr2jnC25jg/company-logo_200_200/company-logo_200_200/0/1666495097363/colorado_clean_energy_fund_logo?e=2147483647&v=beta&t=FdsdDf98dI4jSxzXuFwMYczDWPzWzOrlrAI20fenstk", "about_us": "CCEF is a mission-based impact investment fund that aims to mitigate climate change, advance environmental and economic justice, and create a healthier and more resilient Colorado by expanding access to capital to underserved projects and communities.\n\nCCEF was born out of a three-year collaboration among the Colorado Energy Office (CEO), the Department of Energy (DOE) and the Coalition for Green Capital (CGC). \n\nThis collaboration aligned to create CCEF with a shared belief that a specialized, nonprofit intermediary was necessary to identify barriers to financing clean energy projects, bridge the gap between clean energy projects and traditional capital providers, and to drive demand for these solutions by performing market engagement and development activities.", "num_of_employees": "not-found", "website": "https://www.cocleanenergyfund.com/", "industry": "Financial Services", "company_size_approx": "2-10", "headquarters": "Golden, CO", "type": "Nonprofit", "founded": "2019", "specialties": "Clean Energy and Finance", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "HED", "linkedin_followers_count": 17111, "company_logo_url": "https://media.licdn.com/dms/image/v2/C510BAQGP7dz6D_CPEA/company-logo_200_200/company-logo_200_200/0/1631339777103?e=2147483647&v=beta&t=LbngiH455g38IwH7EJ7udzC8i5VsaLH63Wsfa0h702c", "about_us": "At HED, great design is about thinking creatively to overcome challenges and improve real world outcomes. Our firm has a long history and reputation for excellence because we believe that all the facets of our design, from architecture, consulting, engineering, and planning, must create a positive impact for our clients, the community, and the world through responsive, innovative, and sustainable design solutions.\n\nThis belief has allowed our firm to succeed and grow in a broad range of markets in nine U.S. offices (Boston, Chicago, Dallas, Detroit, Denver, Los Angeles, San Diego, San Francisco, and Sacramento) in a variety of markets from education (Higher Ed and Pre K-12), Healthcare, Mission Critical, Workplace, Housing & Mixed-Use, Science and Advanced Manufacturing, Community, and Federal & Transportation. \n\nSee how HED advances your world at www.hed.design.", "num_of_employees": "not-found", "website": "http://www.hed.design", "industry": "Design Services", "company_size_approx": "201-500", "headquarters": "Royal Oak, MI", "type": "Privately Held", "founded": "1908", "specialties": "Architecture, Engineering, Master Planning, Urban Planning, Interior Design, Landscape Design, Strategic Consulting, Sustainable Consulting, Lab Planning, Structural Engineering, MEP Engineering, Environmental Graphic Design, and Sustainable Design", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Francke | French Architects", "linkedin_followers_count": 84, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQGzrWES8KBAjw/company-logo_200_200/company-logo_200_200/0/1631332117347?e=2147483647&v=beta&t=K9jImo-gmlS9SwjrfvtCpe73FW6aizmRlGAN_I3rtv0", "about_us": "Francke l French Architects, LLC\r\n\r\nCo-founded by Monte French and Matthew Francke in June of 2014, Francke l French Architects is a new and flourishing design firm located in the beautiful South End district of Boston, Ma.  Together Monte and Matthew bring over 30 years of experience to the table in a wide range of project types and sizes. \r\nThe firm was established and predicated on a core philosophy that centers around the client, the place and the environment.  It is with creative excellence that we can deliver unique solutions to the clients program components, schedule and budget, and building designs that are respectful to place, people, space and our environment.\r\n \r\nFrancke l French provides Architectural, Interiors, Planning and Project Management services for any project type, and in any location.", "num_of_employees": "not-found", "website": "http://francke-french.com", "industry": "Architecture and Planning", "company_size_approx": "2-10", "headquarters": "Boston, Massachusetts", "type": "Partnership", "founded": "2014", "specialties": "Architecture, Construction, Interior Design, Project Management, and Planning and Feasiblility", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "KMA Design Studio", "linkedin_followers_count": 1173, "company_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQGN0VfTSHVkGw/company-logo_200_200/company-logo_200_200/0/1719850928315/kma_design_studio_logo?e=2147483647&v=beta&t=f4TqJAtKjuF1ALJV7XmEdLZa83j7k1Q5cuhqyiA43nc", "about_us": "For over four decades, the firm has satisfied the needs of clients from an array of different sectors, which serves as a powerful testament to KMA's flexibility and an overarching process that allows the team to offer clients an array of perspectives gained from this cumulative work. We pride ourselves on a portfolio that is diverse with a wide-range of project types. \n\nWork types range from Federal and Local Government Projects to Residential Projects and everything in between. Our firm's team is comprised of architects and design professionals with years of experience in these wide-ranging types of projects.", "num_of_employees": "not-found", "website": "http://www.kma-studio.com", "industry": "Architecture and Planning", "company_size_approx": "51-200", "headquarters": "Ambler, PA", "type": "Privately Held", "founded": "1977", "specialties": "Architecture, Interior Design, Senior Living, Affordable Housing, Storage, YMCAs, Mixed Use, Preservation, and Historic Preservation", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "United Mechanical", "linkedin_followers_count": 7470, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQE0utdi2iHfEA/company-logo_200_200/company-logo_200_200/0/1708450777137?e=2147483647&v=beta&t=iIzVvLMhURVd5dweGco_I9I7iybV1FeB_E0atF8TzB4", "about_us": "United Mechanical specializes in HVAC and Plumbing systems design, construction, retrofit, repair, and 24/7 emergency service for commercial and industrial properties throughout Northern California. Our clients include the largest general contractors, developers, owners, and property managers within the Bay Area. We consistently rank within the top 5 mechanical contractors within the region in annual revenue, and are proud to have played a key role in some of the area’s most high-profile and technically demanding projects.\n\nFounded in 2003 by Tom Sosine and Jon Gundersen, United Mechanical was built on the philosophy that there is no client more important than you, and no project more important than yours. Therefore, we treat every new project as an important opportunity to build a lasting relationship, as reliable and durable as our work. To that end, United Mechanical is continually investing in and developing the top talent and resources in the industry, in order to deliver best-in-class project management, design/engineering, fabrication, installation, and maintenance services. You can depend on United Mechanical to be your trusted partner for the complete life cycle of your HVAC and Plumbing systems.\n\nwww.UMI1.com", "num_of_employees": "not-found", "website": "http://www.UMI1.com", "industry": "Construction", "company_size_approx": "201-500", "headquarters": "San Jose, CA", "type": "Privately Held", "founded": "2003", "specialties": "HVAC Construction, Plumbing, HVAC Design / Build, HVAC Service and Planned Maintenance, Design-Build, and Service", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Cornerstone Engineering, Inc.", "linkedin_followers_count": 578, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQFU9vV9vvsZJQ/company-logo_200_200/company-logo_200_200/0/1630553786374?e=2147483647&v=beta&t=THXogeFbHOqDQldbifQ07p-d-67_1IMjQVBri7D2VjI", "about_us": "Cornerstone Engineering, Inc. is an award-winning engineering consulting and construction firm that works with government and private-sector clients to build new facilities that stand the test of time and to strengthen aging facilities. With an accomplished staff of engineers and designers who represent the company’s commitment to serve its communities, Cornerstone has forged lasting relationships with its clients over its 18 years in business.\n\nThe company has built its reputation by solving complex challenges in water, wastewater and building sectors. Cornerstone was among the first in the nation to use Fiber Reinforced Polymer, a strengthening technology that extends useful life of aging infrastructure. As a result, Cornerstone is sought after by clients from around the country who need smart thinking and innovative solutions for complex projects.\n\nThe firm serves more than a dozen states in the Midwest, Southeast and other areas across the country. Headquartered in Louisville, Kentucky, Cornerstone also has offices in Indiana, Ohio, & Arizona.\n\nCornerstone has been recognized regionally and nationally, having been named to the Asian American Fast 100 list for two years in a row (2017, 2018) and to the Inc. 5000 list of fastest growing companies in the U.S, also two years in a row (2017, 2018). Cornerstone is an SBA 8a, MBE, DBE, & SBE Certified Company.", "num_of_employees": "not-found", "website": "http://cei-engineering.com", "industry": "Civil Engineering", "company_size_approx": "11-50", "headquarters": "Louisville, Kentucky", "type": "Public Company", "founded": "2003", "specialties": "FRP Strengthening, Water Treatment Structures, Historic Structural Retrofits, and Water Distribution Structures", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Neighboring Concepts", "linkedin_followers_count": 935, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQGmj6r0TGkGKw/company-logo_200_200/company-logo_200_200/0/1653586787773/neighboring_concepts_logo?e=2147483647&v=beta&t=sjkVImZpkHTBacWYp8aXzABMZMZN0Yg1TVD4AAGir6o", "about_us": "We are a unique and inventive multidisciplinary design group of professionals working together to create, enhance and connect communities through smart design and responsible planning. We've been in Charlotte, NC since our inception in 1996. Our name, Neighboring Concepts, represents everything we stand for as a diverse and cohesive team. Our design work can be found across the Southeast region and beyond in various project types, sizes and locations.", "num_of_employees": "not-found", "website": "http://neighboringconcepts.com", "industry": "Architecture and Planning", "company_size_approx": "11-50", "headquarters": "Charlotte, North Carolina", "type": "Privately Held", "founded": "1996", "specialties": "Architecture, Planning & Urban Design, Interiors, and Development & Revitalization", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Clean Development Group (CDG) Inc.", "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQFjX5rNKC3nrg/company-logo_200_200/company-logo_200_200/0/1631333918647?e=2147483647&v=beta&t=XdjARw0eyzZ4u-pSV4CdudG6k6OLTj-58gGctv6SiDM", "about_us": "The Clean Development Group (CDG) specializes in Global Climate Change and Sustainable Development. With 20 years of international experience in both timely and globally critical areas, CDG provides the following services to the world: international public, corporate, organization, and community solutions; sustainable development strategies (SDS); comprehensive policy frameworks; project development and management; ESG; LCA; climate litigation; R&D; report drafting; field work; public speaking; mediation/negotiation; and award-winning professional film and audio production and narration, among a range of additional sustainability services. Having worked globally with the public (all levels of government), private (various multinationals), international organization (UN), NGO, and academic sectors, director Dr. Scott Phipps has been formally recognized by the United Nation's for his expertise and vast international work and achievements. Dr. Phipps periodically gives talks at various UN conferences on climate change and global sustainable development, and is always looking forward to speaking with a wide variety of audiences who would like to learn more about how to effectively address sustainable development and climate issues.", "num_of_employees": "not-found", "website": "https://cdgclimate.com/", "industry": "Operations Consulting", "company_size_approx": "2-10", "headquarters": "Highlands East", "type": "Privately Held", "founded": "2007", "specialties": "Sustainable Development, Climate Change, Strategies, Clean Energy, Policy Frameworks, R&D, Report Drafting, Public Speaking, Award-winning Film and Sound Production, Negotiation Services", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "UAMPS", "linkedin_followers_count": 1629, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQEEum1v3f5Rqg/company-logo_200_200/company-logo_200_200/0/1707513262206/uamps_logo?e=2147483647&v=beta&t=_LACwiC80gSQgGkYoIWZmzcS4MHgtHBs45h4BqwuUU4", "about_us": "Utah interlocal joint-action agency supplying  energy, and power services to  49 members in 7 States. \r\n\r\nCheck out our website for more information.", "num_of_employees": "not-found", "website": "http://www.uamps.com", "industry": "Utilities", "company_size_approx": "11-50", "headquarters": "Salt Lake City, Utah", "type": "Government Agency", "founded": "1980"},
{"company_name": "San Diego Community Power", "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQFGv36SCGIY5w/company-logo_200_200/company-logo_200_200/0/1719859458447/san_diego_community_power_logo?e=2147483647&v=beta&t=4WBLW8ZrNvaFcvfDbeGykzVi4Ql8JYcJMafas0kZLfQ", "about_us": "San Diego Community Power is a not-for-profit public agency bringing you cleaner energy at competitive rates.\n\nWe provide reliable, affordable electricity to nearly 1 million customer accounts in the Cities of San Diego, Chula Vista, Encinitas, La Mesa, Imperial Beach and National City, as well as the unincorporated communities of San Diego County.", "num_of_employees": "not-found", "website": "https://www.sdcommunitypower.org/", "industry": "Utilities", "company_size_approx": "11-50", "headquarters": "San Diego", "type": "Government Agency"},
{"company_name": "Redwood Coast Energy Authority", "linkedin_followers_count": 749, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQHhNA-eMFu9iA/company-logo_200_200/company-logo_200_200/0/1630648075340/redwood_coast_energy_authority_logo?e=2147483647&v=beta&t=juWnuKufoSHNEcvRmmzL0BPi8XEPKegnxYOcEvumHWg", "about_us": "Redwood Coast Energy Authority is a Renewables and Environment company located in 633 3rd St, Eureka, California, United States.\n\nThe purpose of the Energy Authority is to develop and implement sustainable energy initiatives that reduce energy demand, increase energy efficiency, and advance the use of clean, efficient and renewable resources available in the region for the benefit of the Member agencies and their constituents. To further that purpose, the Redwood Coast Energy Authority works toward the following goals:\n\nTo lead, coordinate and integrate regional efforts that advance secure, sustainable, clean and affordable energy resources\nTo develop a long-term sustainable energy strategy and implementation plan\nTo increase awareness of, and enhance access to, energy conservation, energy efficiency, and renewable energy opportunities available to the region\nTo add value to, but not duplicate, energy services offered by utilities and others serving the region\nTo keep key decision makers and stakeholders informed of policy, regulatory, and market changes that are likely to impact the region\nTo support research, development, demonstration, innovation, and commercialization of sustainable energy technologies by public and private entities operating in Humboldt County\nTo develop regional capabilities to respond to energy emergencies and short-term disruptions in energy supply, infrastructure, or markets that could adversely affect Humboldt residents and businesses", "num_of_employees": "not-found", "website": "http://www.redwoodenergy.org", "industry": "Renewable Energy Semiconductor Manufacturing", "company_size_approx": "11-50", "headquarters": "Eureka, California", "type": "Government Agency", "founded": "2003"},
{"company_name": "Energy Transfer", "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQHigiBFhAjfmg/company-logo_200_200/company-logo_200_200/0/1641307920216/energy_transfer_logo?e=2147483647&v=beta&t=zGKgWgoEOVKiOf-CtXjKNF4x9RlYUY6qMt5ggapgHzs", "about_us": "Energy Transfer LP (NYSE: ET) owns and operates one of the largest and most diversified portfolios of energy assets in the United States, with more than 125,000 miles of pipeline and associated energy infrastructure. Energy Transfer’s strategic network spans 44 states with assets in all of the major U.S. production basins. Energy Transfer is a publicly traded limited partnership with core operations that include complementary natural gas midstream, intrastate and interstate transportation and storage assets; crude oil, natural gas liquids (“NGL”) and refined product transportation and terminalling assets; and NGL fractionation. Energy Transfer also owns Lake Charles LNG Company, as well as the general partner interests, the incentive distribution rights and approximately 34% of the outstanding common units of Sunoco LP (NYSE: SUN), and the general partner interests and approximately 47% of the outstanding common units of USA Compression Partners, LP (NYSE: USAC).", "num_of_employees": "not-found", "website": "http://www.energytransfer.com/", "industry": "Oil and Gas", "company_size_approx": "10,001+", "headquarters": "not-found", "type": "1996", "specialties": "Natural Gas, Refined Products, Natural Gas Liquids (NGLs), Crude Oil, and Pipelines", "funding": "US$ 611.6M", "funding_total_rounds": 5, "funding_option": "Post IPO secondary", "last_funding_round": "Sep 9, 2024"},
{"company_name": "Carbonvert", "linkedin_followers_count": 2102, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQH3AJ6txVnMKQ/company-logo_200_200/company-logo_200_200/0/1630617943866?e=2147483647&v=beta&t=1xITTpa-QeLyvzc6haTiMf3_2IyEYVwnZwGT1ime_jU", "about_us": "Carbonvert Inc. is a carbon capture and storage project development and finance company that simplifies decarbonization for industrial facilities.   Carbonvert was established in late 2020 by veterans of the renewable and conventional energy sectors to manage the financial and technical complexities of CCS project development.  Our executives have 70+ years of combined experience developing projects, financing tax advantaged projects, and structuring infrastructure investments up to $4 billion, including equity, tax equity, and debt for large assets.  Our executives have extensive experience with large-scale CO2 projects and have designed, secured environmental and CO2 storage permits, and completed and operated large-scale carbon capture, transportation, and storage projects notably Petra Nova CCS in Thompsons, Texas, Quest CCS in Alberta, Canada, and In Salah in Algeria. For more information, visit www.carbonvert.com.", "num_of_employees": "not-found", "website": "http://www.carbonvert.com", "industry": "Environmental Services", "company_size_approx": "2-10", "headquarters": "Denver, Colorado", "type": "Privately Held"},
{"company_name": "Ackerman CPAs, LLC", "linkedin_followers_count": 190, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQHoL9GfB6v-Ww/company-logo_200_200/company-logo_200_200/0/1630652632868/ackermancpas_logo?e=2147483647&v=beta&t=iSH4dwxzqfTIrDiwMtKu2PaeajvVzPjH8Hwy6_MIB-0", "about_us": "Ackerman CPAs is a full-service CPA firm focused on working with businesses, individuals, and startups in Louisville, Kentucky, and surrounding areas. We believe integrity, honesty, and trust are as important ingredients as the spreadsheets and bank statements we’ll be sharing — with a strong relationship, we can put money back in your hands and give you peace of mind.\n\nFor additional information, please visit us at https://ackcpas.com. \n\nMaterial on this page has been prepared for general informational purposes only and is not intended to be relied upon as accounting, tax, or other professional advice. Please refer to your advisor for specific advice.\n\nPlease note that Ackerman CPAs does not control the advertising that may appear alongside this page.", "num_of_employees": "not-found", "website": "https://ack.cpa/", "industry": "Accounting", "company_size_approx": "2-10", "headquarters": "Louisville, Kentucky", "type": "Privately Held", "founded": "2016", "specialties": "Taxation, CPA, Accounting, Bookkeeping, and Financial Statements", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "KENTUCKIANA ELECTRICAL SERVICES", "linkedin_followers_count": 69, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQGwK9UC_j0hrw/company-logo_200_200/company-logo_200_200/0/1630624241495/kentuckiana_electrical_service_logo?e=2147483647&v=beta&t=1YRoKuj4-J1xA4XVZvDsYXd8wjwzIQlvh3zNi_YBabQ", "about_us": "Kentuckiana Electrical Services is an Electrical Construction Contractor based out of Shepherdsville, KY 40165.", "num_of_employees": "not-found", "website": "http://keslou.com", "industry": "Construction", "company_size_approx": "11-50", "headquarters": "Shepherdsville, Kentucky", "type": "Privately Held", "founded": "2013"},
{"company_name": "Strategic Energy Solutions, Inc.", "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQFcHDRnp-1oLQ/company-logo_200_200/company-logo_200_200/0/1630578779663/strategic_energy_solutions_logo?e=2147483647&v=beta&t=yIx-wY-ZhGW6NfqwSdb4Dg3X9QrSKnpPFgMxTOmhNak", "about_us": "Strategic Energy Solutions, Inc.® (SES), is a mechanical and electrical consulting engineering firm.  With a focus on sustainable design and energy conservation, we will work with you to design the right solution for your project. Headquartered in Berkley, Michigan, we offer professional engineering design services to the architectural and construction industry.\n\nOur services include:\n• Consulting Engineering: mechanical, electrical, plumbing, fire protection, low voltage, lighting design, building information modeling (BIM), design-build\n• Assessments & Studies: facility assessment, energy audit, life cycle cost analysis, total cost of ownership, commissioning\n• Sustainability: alternative energy, LEED design, geothermal, energy modeling, daylight harvesting, solar thermal, solar photovoltaic (PV), building management systems\n\nLearn more by emailing us at hello@sesnet.com, or calling 248-399-1900.\n\n#SES #StrategicEnergySolutions #MEP", "num_of_employees": "not-found", "website": "http://www.sesnet.com", "industry": "Architecture and Planning", "company_size_approx": "11-50", "headquarters": "not-found", "type": "1997", "specialties": "Mechanical, Electrical, Plumbing, Fire Protection, Geothermal, Lighting Design, Low Voltage/IT, LEED/Sustainable Design, Historic Redevelopment, Facility Assessments, Commissioning, Energy Management, Energy Modeling, Multi-Tenant Residential, K12 & Higher Education, Student Housing, Senior Living, Healthcare, Parking Decks, and Government/Municipal", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Evans Engineering and Consulting, PLLC", "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQGexw2lJhT38g/company-logo_200_200/company-logo_200_200/0/1630589142219?e=2147483647&v=beta&t=HlQjoP8AVi7tP4GlY4iAV8PWt1dSRDCJhC3EgX434II", "about_us": "Evans Engineering and Consulting is a progressive and detail oriented firm with a strong background in all aspects of Electrical Engineering Design. Located in the heart of the Pacific Northwest, our group is proud to have been a part of many projects that involve a conscious team effort of design, function, opportunity, and aesthetic presence that blends naturally with the environment. Our open minded and honest approach to every project, and every client, has proved successful in all we do.\n\nOur Professional Engineering team has a wide array of design experience and capabilities that allow us to complete any project with precision and professionalism. With a staff of Engineers licensed in Idaho, Washington, Montana and Oregon, we're knowledgeable of multi-jurisdiction requirements.\n\nAt E2C we believe every employee is a vital participant to the success of the company. That combined effort can be seen translated into every electrical design project we do. Our success is directly related to the success of our clients, and we strive to consistently make every project successful.", "num_of_employees": "not-found", "website": "http://www.e2cengineers.com/", "industry": "Design Services", "company_size_approx": "2-10", "headquarters": "not-found", "type": "2013"},
{"company_name": "Insight Architects", "linkedin_followers_count": 504, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQFBSKZPu8IMxw/company-logo_200_200/company-logo_200_200/0/1631351706426?e=2147483647&v=beta&t=GiVTmkBLhkQEPLHZNvlZ4m2aoZ9ro7oq-E40B4OrKFU", "about_us": "Insight Architects envisions each project as a new opportunity to discover innovative concepts that can add personal and financial value to a project, business and community. We have worked with a wide variety of clients and project types ranging from small boutique restaurants and retail to large institutional buildings for major universities.\r\nInsight Architects provides large firm experience in a small firm package. The partners at Insight work directly on each project. We use an integrated, holistic design approach by including our clients, consultants and other stakeholders into the design process early on. We are involved in every detail and in all aspects of the design process, from feasibility and concept development through construction administration.", "num_of_employees": "not-found", "website": "http://www.insightarch.com", "industry": "Architecture and Planning", "company_size_approx": "2-10", "headquarters": "Charlotte, North Carolina", "type": "Public Company", "founded": "2003", "specialties": "Adaptive Reuse, Sustainability, Education, Homes, Offices, Restaurants + Retail, and Sustainability", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "CEP Renewables", "linkedin_followers_count": 1611, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQFCwUwbuRQqqA/company-logo_200_200/company-logo_200_200/0/1647287750877/cep_renewables_logo?e=2147483647&v=beta&t=Ym7-odf4P6iB9dJ9YfnnLtRNMe0UcrrJlNfpnWnlcf4", "about_us": "CEP Renewables develops, designs, and builds utility-scale solar power plants. CEP Renewables has experience developing solar plants in Europe, Asia, and North America. CEP takes on particularly challenging projects such as browns fields and landfills, repurposing such land for productive use and reducing carbon emissions with sustainable clean energy.", "num_of_employees": "not-found", "website": "https://www.ceprenewables.com/", "industry": "Renewable Energy Semiconductor Manufacturing", "company_size_approx": "2-10", "headquarters": "Red Bank, New Jersey", "type": "Privately Held", "specialties": "Renewable Energy, Solar Developer, and Utility Scale Solar", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "USDA", "linkedin_followers_count": 258455, "company_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQGHu10LMdV11A/company-logo_200_200/company-logo_200_200/0/1719845640942/usda_logo?e=2147483647&v=beta&t=X8MhjzsSa4bJeonRIYr6D3evxZ5JOhxHbEGgZmsa3Hc", "about_us": "The United States Department of Agriculture is the United States federal executive department responsible for developing and executing U.S. federal government policy on farming, agriculture, and food. It aims to meet the needs of farmers and ranchers, promote agricultural trade and production, work to assure food safety, protect natural resources, foster rural communities and end hunger in the United States and abroad.", "num_of_employees": "not-found", "website": "http://www.usda.gov", "industry": "Government Administration", "company_size_approx": "10,001+", "headquarters": "Washington, DC", "type": "Government Agency", "specialties": "USDA is committed to providing safe and nutritious food, conservation, sustainable food production and revitalizing rural America.", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Veolia North America", "linkedin_followers_count": 110691, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQGwmh_B0fUWdQ/company-logo_200_200/company-logo_200_200/0/1630599317212/veolianorthamerica_logo?e=2147483647&v=beta&t=_UNKKgm9XIK81UkLOQ5cplJfS1kcj0b-9NCRXLYYiIM", "about_us": "For more than 170 years, Veolia has been by the side of cities, industries and communities to help them manage, regenerate and protect their critical resources in the face of environmental challenges. \n\nWe minimize climate impact: From resource efficiency to creating alternatives to fossil fuels, we help cities, utilities and industries reduce their energy consumption, input costs, account greenhouse gas emissions, and report and verify progress.\n\nWe treat pollution: From decontaminating water to handling toxic and radioactive waste, we help cities, communities and industries reach the highest safety and environmental standards while protecting their natural surroundings.\n\nWe optimize resources: From recycling electric vehicle batteries to reusing wastewater, we help cities and industries recover byproducts for efficient reuse which reduces demand on natural resources.\n\nLearn more about what we do at www.veolianorthamerica.com\n\nFor specific information about Veolia North America in Canada, visit us at www.veolia.ca", "num_of_employees": "not-found", "website": "http://www.veolianorthamerica.com", "industry": "Environmental Services", "company_size_approx": "5,001-10,000", "headquarters": "Boston, MA", "type": "Public Company", "specialties": "Hazardous & Regulated Waste Management, Water Partnership Services, Wastewater Partnership Services, Design, Build, Operate & Maintain, Energy Efficient Solutions, and Sustainability As A Service", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Polk County Health Services", "linkedin_followers_count": 123, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQEUV7th4jPCvg/company-logo_200_200/company-logo_200_200/0/1630586837110/polk_county_health_services_logo?e=2147483647&v=beta&t=fj0o_P8yhe3DuTVKUDOXzstPb3vLGRZWyDvNH_SSVvU", "about_us": "External link for Polk County Health Services", "num_of_employees": "not-found", "website": "https://www.polkcountyiowa.gov/HealthServices", "industry": "Non-profit Organizations", "company_size_approx": "2-10", "headquarters": "Des Moines, Iowa", "type": "Nonprofit"},
{"company_name": "Sunpin Solar", "linkedin_followers_count": 2506, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQFPAD_U1wzFqQ/company-logo_200_200/company-logo_200_200/0/1630625029942/sunpinsolar_logo?e=2147483647&v=beta&t=2aeWOgVyG1YRte3nzZOVjIxJcxvErav4Jz2AgjBNzK0", "about_us": "Sunpin Solar, established in 2012, is one of the leading commercial and utility-scale solar developers in the United States, recognized as a 2019 Top 3 Solar Developer and 2018 Top 4 Solar Developer in the U.S by Solar Power World.\nHeadquartered in Irvine California, Sunpin Solar provides expertise with regional offices and personnel in Illinois, Massachusetts, Ohio, New York, Texas, Maryland, and Pennsylvania. Sunpin Solar has established prosperous relationships with corporate energy buyers, landowners, housing authorities, municipalities, electric utilities and financiers.", "num_of_employees": "not-found", "website": "http://www.sunpinsolar.us", "industry": "Renewables & Environment", "company_size_approx": "11-50", "headquarters": "Irvine, California", "type": "Privately Held", "founded": "2012", "specialties": "Solar Energy, Solar photovoltaic projects, Photovoltaic solar plants, Solar investment and development company, Utility, Renewable Energy, Clean Energy, and Utility Scale Solar Projects", "funding": "US$ 50.0M", "funding_total_rounds": 1, "funding_option": "Debt financing", "last_funding_round": "Jan 22, 2021"},
{"company_name": "Clean Energy Group", "linkedin_followers_count": 2614, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQGGJ1RtV-4vhg/company-logo_200_200/company-logo_200_200/0/1631302922914?e=2147483647&v=beta&t=JMPnFKLoRSSTJp-qWMLG7W__T6TCV6Bt_RYrzFR9lMc", "about_us": "Clean Energy Group (CEG) works at the forefront of clean energy innovation to enable a just energy transition to address the urgency of the climate crisis.\n\nWe fill a critical resource gap by advancing new energy initiatives and serving as a trusted source of technical expertise and independent analysis in support of communities, nonprofit advocates, and government leaders working on the frontlines of climate change and the clean energy transition. We collaborate with partners across the private, public, and nonprofit sectors to accelerate the equitable deployment of clean energy technologies and the development of inclusive clean energy programs, policies, and finance tools.\n\nFounded in 1998, CEG has been a thought leader on effective climate and clean energy strategies for more than two decades. Clean Energy Group specializes in providing resources and assistance related to emerging technology trends and transformative policy, regulatory, and market approaches. To learn more about our current initiatives, please see our project page.\n\nCEG manages and staffs the Clean Energy States Alliance (CESA), a leading nonprofit coalition of state energy organizations working together to advance the rapid expansion of clean energy technologies and bring the benefits of clean energy to all.", "num_of_employees": "not-found", "website": "http://www.cleanegroup.org", "industry": "Non-profit Organizations", "company_size_approx": "11-50", "headquarters": "Montpelier, VT", "type": "Nonprofit", "founded": "1998", "specialties": "Clean Energy Policy Development, Market Transformation, Renewable Energy, Energy Storage, Resilient Power, Offshore Wind, and Environmental Justice", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "City of Seattle", "linkedin_followers_count": 68449, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQEJhueMqLSf-w/company-logo_200_200/company-logo_200_200/0/1662072356624/city_of_seattle_logo?e=2147483647&v=beta&t=WGXXadmTv_QIlq1H7KMJ1ob3dGxIVxlK6hMwalI7Yvo", "about_us": "As a city, Seattle is known as a progressive leader in technology, innovation, and the environment.  As an employer, the City of Seattle is leading local government in environmental stewardship, green building, and social justice, making our City what it is today and shaping our future. Our employees play an important role in making this possible.\n\nYou might be surprised by the variety and range of opportunities that are available at the City of Seattle. We have more than 1,100 job titles in more than 30 different departments, from the Office of Immigrant and Refugees Affairs or the Office of Arts & Culture to the Public Utilities and Department of Transportation. Our positions range from seasonal work at the City’s parks and recreation facilities to skilled trade workers, accounting, communications and information technology professionals, and middle and senior-level management. Whatever your line of work, we hope you consider the City of Seattle in your job search. We likely have the opportunity for you! \n\nBe a part of the team that helps run our great city by joining the more than 12,000 employees working for the greater good by providing programs and services to Seattle’s people and businesses. View our current opportunities under Careers or click here: http://www.seattle.gov/jobs/ to apply today.\n\nIf you are seeking a City service, please get in touch with our Customer Service Bureau - https://www.seattle.gov/customer-service-bureau\n\nCome build your career and your community with us!\n\nView the City's policies at seattle.gov/digital", "num_of_employees": "not-found", "website": "http://www.seattle.gov", "industry": "Government Administration", "company_size_approx": "10,001+", "headquarters": "Seattle, WA", "type": "Government Agency"},
{"company_name": "Navajo Tribal Utility Authority - NTUA", "linkedin_followers_count": 1116, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQEjaBU-fC6rew/company-logo_200_200/company-logo_200_200/0/1706136222982/navajotribalutilityauthority_logo?e=2147483647&v=beta&t=H1y1OxewxS-Td58d5cLuJN4ih4E8ZH7rRG8C2b3Mkl4", "about_us": "NTUA supplies and extends electricity, water, natural gas, wastewater treatment, and solar power services to homes and businesses throughout the 26,000 square mile Navajo Nation and neighboring communities. \r\n\r\nNTUA purchases electrical power from off the Navajo Nation and transmits that power to homes throughout northern Arizona, northwestern New Mexico, and southeastern Utah. Even as NTUA works hard to meet the basic utility needs of the Navajo Nation an estimated 18,000 families are without access to electricity, and many more homes and families are without access to basic infrastructure, such as water, wastewater, and natural gas services. \r\n\r\nAs a non-profit enterprise, NTUA receives federal loans and grants to extend electrical power to rural communities. What money NTUA generates is returned to maintain, operate, and upgrade utility infrastructure.", "num_of_employees": "not-found", "website": "http://www.ntua.com", "industry": "Utilities", "company_size_approx": "501-1,000", "headquarters": "Fort Defiance , Arizona", "type": "Nonprofit", "founded": "1959"},
{"company_name": "Plunkett Raysich Architects, LLP", "linkedin_followers_count": 7049, "company_logo_url": "https://media.licdn.com/dms/image/v2/C510BAQEWUp6c8xpg5Q/company-logo_200_200/company-logo_200_200/0/1631343533017?e=2147483647&v=beta&t=bPoDk6sRMst10IejHp0k7YsgBP7iIxpNv6gZOb2wpSQ", "about_us": "Plunkett Raysich Architects, LLP is an award-winning Architectural and Interior Design firm dedicated to delivering innovative design solutions. We specialize in projects that comprise the essence of communities — where you live, work, play, learn, worship, and retire. We are passionate about turning our clients’ aspirations into reality.\n\nWe enjoy challenges.  Do you have any?  Contact us to see how we may help!", "num_of_employees": "not-found", "website": "http://www.prarch.com", "industry": "Architecture and Planning", "company_size_approx": "51-200", "headquarters": "Milwaukee, WI", "type": "Partnership", "founded": "1935", "specialties": "Facility Branding, Architectural Design, Healthcare Design, Educational Building Design, Long Term Care Design, Residential Design, Sustainable Design, Office Design, Master Planning, BIM, Interior Design, Hospitality Design, Civic Building Design, and Senior Living Design", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Progressive Companies", "linkedin_followers_count": 7758, "company_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQH50zdTKTaucQ/company-logo_200_200/company-logo_200_200/0/1710202876187/progressive_ae_logo?e=2147483647&v=beta&t=_2hJKtDMI2MJ7NZ9rfSOrTHJBOg4iABspxmJdwR-ExA", "about_us": "We are designers of a bold new future, creating high-performance structures and pathways that deliver what clients need today and preparing them for what’s to come. Our portfolio is broad and deep, representing many industries and communities throughout the nation. Employee owners bring an entrepreneurial spirit to our work because when our projects and partners succeed, so do we. The firm is dedicated to giving back to the communities we serve through volunteer opportunities, corporate sponsorships, and a commitment to sustainable and inclusive design. We have offices in Charlotte, NC, Detroit, MI, and Grand Rapids, MI.", "num_of_employees": "not-found", "website": "http://www.weareprogressive.com", "industry": "Architecture and Planning", "company_size_approx": "201-500", "headquarters": "Grand Rapids, MI", "type": "Privately Held", "founded": "1962", "specialties": "Architectural, Engineering, Consulting, Planning, Interior Design, Landscape Architecture, Universal Design, Sustainable Design, Urban Design and Planning, Healthcare Planning, Water Resources, Workplace Strategy, Change Management, and Construction Management", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Studio S Architecture", "linkedin_followers_count": 353, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQF2oPXzZYJo8A/company-logo_200_200/company-logo_200_200/0/1630458438817/studio_s_architecture_logo?e=2147483647&v=beta&t=-CH69cXjxNLNOPh58cTesG87xfawLjKydawVc90hKeg", "about_us": "Studio S Architecture is a firm dedicated to providing the highest level of design & service to our clients. Whether it is a large corporate headquarters ground up project, or a small interior renovation, we strive to give every project the focus & attention required to achieve your goals. With over 20 years of experience in architectural design and construction management, Studio S Architecture is an innovative, collaborative, and experienced firm that will work with you to turn your ideas into reality.", "num_of_employees": "not-found", "website": "http://www.studioSarchitecture.net", "industry": "Architecture and Planning", "company_size_approx": "1", "headquarters": "Stoughton, Massachusetts", "type": "Privately Held", "founded": "2015", "specialties": "Commercial Design, Space Planning, Architectural Rendering, Construction Management, Building Information Modeling, and Residential Design", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Green Lantern Solar", "linkedin_followers_count": 1732, "company_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQHMMmjGosbzCA/company-logo_200_200/company-logo_200_200/0/1719835907155/green_lantern_solar_logo?e=2147483647&v=beta&t=JUJdCsLSB2IvdajNOaTlVJzqgZSvjk-POuadyr8EAxA", "about_us": "Green Lantern Solar is a vertically integrated regional renewable energy development company with a particular emphasis on turn-key commercial solar solutions for municipal, education, healthcare and government entities. Green Lantern works with landowners to revitalize and re-develop low-value sites such as brownfields, landfills, quarries/pits/extraction sites and other challenging real estate. The company provides a full suite of services: development, financing, construction and operations, maintenance and asset management.", "num_of_employees": "not-found", "website": "http://www.greenlanternsolar.com", "industry": "Solar Electric Power Generation", "company_size_approx": "11-50", "headquarters": "Waterbury, VT", "type": "Privately Held", "founded": "2011", "specialties": "Solar project development, Solar project financing, solar project construction, and Solar asset management", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Metropolitan Transit Authority of Harris County", "linkedin_followers_count": 10683, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQETJuKEQSZ7Zw/company-logo_200_200/company-logo_200_200/0/1630609916763/metropolitan_transit_authority_of_harris_county_logo?e=2147483647&v=beta&t=VQ2W2e3sdQNitStAnbH1Cct0t66S4chLF8C2Q04fDEE", "about_us": "The Texas State Legislature authorized the creation of local transit authorities in 1973. In 1978, Houston-area voters created METRO and approved a one-cent sales tax to support its operations. METRO opened for business in January 1979. The Authority has transformed a broken bus fleet into a regional multimodal transportation system. \r\n\r\nCommunities that are part of the METRO area include the cities of Houston, Bellaire, Bunker Hill Village, El Lago, Hedwig Village, Hilshire Village, Humble, Hunters Creek, Katy, Missouri City, Piney Point, Southside Place, Spring Valley, Taylor Lake Village and West University Place. Major portions of unincorporated Harris County are also included.", "num_of_employees": "not-found", "website": "http://www.RideMETRO.org/", "industry": "Ground Passenger Transportation", "company_size_approx": "1,001-5,000", "headquarters": "Houston, Texas", "type": "Government Agency", "founded": "1979", "specialties": "public transportation", "funding": "US$ 40.4M", "funding_total_rounds": 1, "funding_option": "Grant", "last_funding_round": "Jul 26, 2023"},
{"company_name": "Iowa Lakes Electric Cooperative", "linkedin_followers_count": 221, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQHIP7CtuUqjRw/company-logo_200_200/company-logo_200_200/0/1631307299235?e=2147483647&v=beta&t=W9WtF-aXmCDIjCMpS4iDOu6xfjDK5XDEGs5Ml8pmLW0", "about_us": "Iowa Lakes Electric Cooperative serves over 12,000 member-owner accounts in the counties of Buena Vista, Cherokee, Clay, Dickinson, Emmet, Kossuth, Palo Alto, and Pocahontas, Iowa. Iowa Lakes Electric Cooperative is dedicated to leadership and growth by providing reliable, competitively-priced energy and other valuable services to benefit their member-owners, their customers and the communities they serve.", "num_of_employees": "not-found", "website": "http://www.ilec.coop", "industry": "Utilities", "company_size_approx": "51-200", "headquarters": "Estherville, IA", "type": "Nonprofit"},
{"company_name": "Norton Rose Fulbright", "company_logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQHHO3iT_laqOw/company-logo_200_200/company-logo_200_200/0/1719918829316/nortonrosefulbright_logo?e=2147483647&v=beta&t=cM6S7cI5puGyyLyJ917_AwEDtI6jtJ0n0SdDGxra9DA", "about_us": "Software Development", "num_of_employees": "not-found"},
{"company_name": "Georgia Tech School of Electrical & Computer Engineering", "linkedin_followers_count": 5106, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQHxIdielWr_Bw/company-logo_200_200/company-logo_200_200/0/1655218271107?e=2147483647&v=beta&t=UnDgM3elppSny5PYE0IidWJZwDcEB8VQJVdr6linsJk", "about_us": "The School of Electrical and Computer Engineering (ECE) at the Georgia Institute of Technology is one of the largest producers of electrical engineers and computer engineers in the United States. From the everyday to the hard to imagine,  ECE is at the core of almost all technology.  Our diverse graduates are among the most highly sought after by industry and by top graduate schools, medical schools, and law schools. From computer chips and satellites to medical devices and renewable energy technologies, electrical and computer engineering makes our modern life possible.", "num_of_employees": "not-found", "website": "https://www.ece.gatech.edu/", "industry": "Higher Education", "company_size_approx": "201-500", "headquarters": "Atlanta, Georgia", "type": "Educational", "founded": "1885", "specialties": "computer engineering  and electrical engineering", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Greenday Finance", "linkedin_followers_count": 6706, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQFZnnBSmVMMcg/company-logo_200_200/company-logo_200_200/0/1713563663819/greenday_finance_logo?e=2147483647&v=beta&t=r3Dflq7hIo__3U58IIUGB72kIfLaGxC4miAqW-iTioQ", "about_us": "WELCOME\nto Greenday Finance, where we're not just saving businesses money, we're illuminating the path to a brighter future! Since 2016, we've been leading the charge in solar solutions for commercial clients in the US. With over 700 transactions under our belt, we've helped businesses save millions on their electricity bills.\n\nBut we're not just here for businesses… we're here for EPC and Solar Developers too! We streamline the financial process, ensuring a fast and easy experience with a high approval rate. Plus, with insurance, repair, and maintenance of the system included, you can trust that your investment is protected. And the best part? No dealer fees or lien on the property!\n\nOUR MISSION?!\nIt's simple: empower businesses, EPCs, and Solar Developers to join the solar revolution! Our Commercial Power Purchase Agreement makes going solar a breeze, offering accessible pathways to reduce carbon footprints and embrace sustainability.\n\nPicture this: a world where solar energy powers progress and businesses shine in harmony with the environment. At Greenday Finance, we're not just dreaming it. We're making it happen, one sunny day at a time. Join us, and let's light up the future together! ☀️\n\nSPECIALTIES\n• Solar Solutions for Commercial Clients\n• Financial Assistance for EPC and Solar Developers\n• Fast and Easy Process\n• High Approval Rate\n• Insurance, Repair, and Maintenance Included\n• No Dealer Fees\n• No Lien on Property\n• Carbon Footprint Reduction Solutions\n• Sustainability Advocacy\n• Streamlined Commercial Power Purchase Agreements (PPA)\n\nThese specialties highlight the key areas of expertise and services offered by Greenday Finance. Learn more on our website or send us an email. \n\n✉ info@greendayfinance.com", "num_of_employees": "not-found", "website": "https://greendayfinance.com/", "industry": "Financial Services", "company_size_approx": "11-50", "headquarters": "Laguna Beach, CA", "type": "Privately Held", "founded": "2016", "specialties": "PPA, Commercial, Industrial, Nonprofits, EPCs, Property owners, Solar Financing, Financing, Solar Solutions, Sustainability, Insurance, Repair & Maintenance, Renewable energy, Financial Assistance, and Reducing carbon footprints", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Grace Hebert Curtis Architects", "linkedin_followers_count": 4625, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQGxq8jZ1OxS3g/company-logo_200_200/company-logo_200_200/0/1630623959991/gracehebert_architects_apac_logo?e=2147483647&v=beta&t=TrElnndEtvJehRaNBLL5lgYJnS3NWb0Rmy2OsHzP6Uw", "about_us": "While we aren't restrained by a signature look, we do have a signature way of doing business that delivers the best solution possible, every step of the way. Grace Hebert Curtis goes beyond just technical experience in order to provide a broad spectrum of design.\n\nEstablished over 50 years ago as C.E. Newman and Fred J. Grace, today Grace Hebert Curtis continues to experience substantial growth in size and reputation. While the foundation of our approach remains the same, flexibility in strategies has continued to drive success and allow the firm to recognize opportunities along the way. We have discovered that although great service never gets old, it takes dedication and finely tuned experience.\n\nOver the years Grace Hebert Curtis has continued to provide clients with clear, understandable, and up-to-date information as their projects progress. Our framework is built on outstanding reputation and legacy, making us a regional powerhouse with national-level capacity and expertise. We offer in-depth knowledge of a broad range of market sectors, and we are actively anticipating and adapting to lead the next generation of design and delivery.\n\nThrough the acquisition of New Orleans-based HMS Architects in 2018, and Curtis Group Architects in 2019, we have continued our tradition of strengthening focus while expanding upon core capabilities. As our clients will attest, Grace Hebert Curtis Architects is dedicated to exploring the possibilities and potential of their vision.\n\nWe innovate. We challenge convention (and ourselves). We win awards, and we enjoy the respect of our industry peers. Most of all, however, we take pride in developing successful projects and building long term client relationships.", "num_of_employees": "not-found", "website": "http://GHC-arch.com", "industry": "Architecture and Planning", "company_size_approx": "201-500", "headquarters": "Baton Rouge, Louisiana", "type": "Partnership", "founded": "1967", "specialties": "Architecture, Interior Architectural Design, Programming, Master Planning, healthcare, justice, k-12, higher ed, commercial, industrial, and religious", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "Grove Climate Group", "linkedin_followers_count": 95, "company_logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQHzzd2-q0w08A/company-logo_200_200/company-logo_200_200/0/1630578692688/grove_climate_group_logo?e=2147483647&v=beta&t=kMKm8z7ksjtNlmLAJUAdAXPoLONn5Ojf4uldNZOeTZk", "about_us": "A few of the services we offer include:\n\nStrategic problem-solving\nCoalition building\nInformation gathering\nStakeholder management\nGovernment relations\nDesign and execute policy campaigns\nBuild and maintain relationships\nDeep dive on research and background", "num_of_employees": "not-found", "website": "http://groveclimategroup.com", "industry": "Government Relations Services", "company_size_approx": "1", "headquarters": "Chapel Hill, NC", "type": "Self-Owned"},
{"company_name": "Camber Partners", "linkedin_followers_count": 5648, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQHzy1q2Z8F2fg/company-logo_200_200/company-logo_200_200/0/1636418451164/camberpartners_logo?e=2147483647&v=beta&t=4Vn7rljFZuyTs6hCqzWb-AwR7wrh4mKh_EiI0b260yY", "about_us": "Camber Partners believes that modern software companies should be architected for mass distribution. In our 25+ years of operating experience, this has meant scalable, data-driven, and capital-efficient growth methods that, when executed properly, accelerate growth and compound enterprise value. Camber provides the capital and operating expertise to support this rapid, disciplined growth. \n\nCamber’s internal Growth team provides functional support in marketing, sales and customer success. Our dedicated data team unlocks the power of marketing, product, and customer data to increase LTV and scale customer acquisition. Camber’s hands-on engagement helps achieve  the go-to-market execution that growth-stage software companies deserve. \n\nCamber prioritizes investment in growing B2B SaaS businesses with $3-15m in recurring revenue, and has a strong preference for Product-Led Growth (PLG) models.", "num_of_employees": "not-found", "website": "http://www.camber.io", "industry": "Venture Capital and Private Equity Principals", "company_size_approx": "11-50", "headquarters": "San Francisco, California", "type": "Privately Held"},
{"company_name": "Wilson Sonsini Goodrich & Rosati", "linkedin_followers_count": 37530, "company_logo_url": "https://media.licdn.com/dms/image/v2/D560BAQFOWjMtAz1LHQ/company-logo_200_200/company-logo_200_200/0/1720195735621/wilson_sonsini_goodrich__rosati_logo?e=2147483647&v=beta&t=DO_drip_pVf-qyeOePswCtvGGichj8wE-lZEJt9_Mqo", "about_us": "Wilson Sonsini Goodrich & Rosati is the premier legal advisor to technology, life sciences, and other growth enterprises worldwide. We represent companies at every stage of development, from entrepreneurial start-ups to multibillion-dollar global corporations, as well as the venture firms, private equity firms, and investment banks that finance and advise them. \n\nThe firm is nationally recognized as a leader in the fields of corporate governance and finance, mergers and acquisitions, private equity, securities litigation, employment law, intellectual property, and antitrust, among many other areas of law. Our distinguished international roster of clients spans a wide variety of industries, including information technology, life sciences, energy and clean technology, social and traditional media, communications, retail, and financial services.\n\nWSGR has offices in Austin; Beijing; Boston; Brussels; Hong Kong; London; Los Angeles; New York; Palo Alto; San Diego; San Francisco; Seattle; Shanghai; Washington, D.C.; and Wilmington, DE.\n\nCalling all WSGR alum: Stay connected to alumni, colleagues, and friends on our WSGR Alumni Network, featuring exclusive content and other special offers. Through the site, we share information with alumni about career opportunities; programs and events; alumni, legal industry, and business news; and professional development training, among other topics. Whether you're looking to expand your professional network, find an expert in your field, renew old friendships or establish new ones, or give back by becoming a career mentor, this website is the right place for you. Visit the following link to sign up: www.wsgralumni.com \n\nFollow us on Twitter: @wilsonsonsini", "num_of_employees": "not-found", "website": "http://www.wsgr.com", "industry": "Law Practice", "company_size_approx": "1,001-5,000", "headquarters": "Palo Alto, CA", "type": "Privately Held", "founded": "1961", "specialties": "Law Firm, Corporate Law, Litigation, Intellectual Property, Antitrust, Regulatory, Securities Litigation, Privacy, Class Actions, Investigations, Patent Litigation, Mergers and Acquisitions, Governance, Energy, Tax, Venture Capital, Technology Transactions, and Finance", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"},
{"company_name": "SMUD", "linkedin_followers_count": 30756, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQEXv7t0SGNhGg/company-logo_200_200/company-logo_200_200/0/1630655758709/smud_logo?e=2147483647&v=beta&t=f6a8fmQ9nudt7YcdlrfAU41IZLfEF4xwEveUNAphWYg", "about_us": "As the nation’s sixth-largest, community-owned, not-for-profit electric service provider, SMUD has been providing low-cost, reliable electricity to Sacramento County for more than 75 years. SMUD is a recognized industry leader and award winner for its innovative energy efficiency programs, renewable power technologies and for its sustainable solutions for a healthier environment. Today, SMUD’s power supply is on average about 50 percent carbon free and SMUD has a goal to reach zero carbon in its electricity production by 2030.\n\nLearn more about what it's like to work at SMUD and see all available positions at smud.org/Careers.", "num_of_employees": "not-found", "website": "http://www.smud.org", "industry": "Utilities", "company_size_approx": "1,001-5,000", "headquarters": "Sacramento, California", "type": "Government Agency", "founded": "1946"},
{"company_name": "Polk Group CPA", "linkedin_followers_count": 14, "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQF07irlAhSQFg/company-logo_200_200/company-logo_200_200/0/1631340057654?e=2147483647&v=beta&t=nWMqFS6rK0PXK58DxA_1s3x7Is5erxdDVYG6GDvkreE", "about_us": "The comprehensive tax, audit and financial planning partners for growing businesses.", "num_of_employees": "not-found", "website": "http://polkgroupllc.com/", "industry": "Accounting", "company_size_approx": "2-10", "headquarters": "Atlanta, Georgia", "type": "Privately Held", "founded": "1990", "specialties": "Individual Tax Preparation & Planning, Audits of Employee Benefit Plans, Business Tax Preparation & Planning, Financial Statement Audits, Compilations & Reviews, Estate, Trust & Gift Tax Preparation & Planning, and General Individual & Business Accounting Services", "funding": "not-found", "funding_total_rounds": 0, "funding_option": "not-found", "last_funding_round": "not-found"}
]